{
  "patterns": {
    "pattern_ff8dfccb_1752800652": {
      "content": "## Summary of the Business Insider Dossier Perfume & Cologne Review\n\n**Dossier** is a New York-based brand, founded in 2018, that specializes in creating affordable, high-quality fragrances inspired by popular luxury perfumes and colognes. The brand’s mission is to democratize access to high-end scents by offering vegan, cruelty-free, and sustainably produced alternatives, starting at just $19. These fragrances are modeled after bestsellers from brands like YSL, Le Labo, Chanel, Gucci, Tom Ford, and Maison Margiela, among others[2][1].\n\n### Key Findings from the Review\n\n- **Quality & Authenticity:** Three Insider Reviews team members tested a range of Dossier fragrances and unanimously agreed that the quality and scent accuracy were impressive. Even people familiar with the original luxury fragrances often couldn’t tell the difference between Dossier’s versions and the originals[2][1].\n- **Affordability:** Dossier’s fragrances are significantly less expensive than their luxury counterparts. For example, a 1.7-ounce bottle of Dossier’s Aromatic Star Anise (inspired by Dior Sauvage) costs $29, compared to $100 for a 2-ounce bottle of Dior Sauvage[2][1].\n- **Packaging:** Dossier uses minimalist, generic packaging made from 100% recycled glass and cardboard. This helps keep costs low but means you won’t get the ornate bottles typical of luxury brands[2][1].\n- **Longevity:** While most Dossier fragrances perform well, some (like Ambery Vanilla, inspired by YSL Black Opium) may not last all day. Application tips, such as layering with lotion, can help extend longevity[2][1].\n- **Risk-Free Shopping:** Dossier offers a generous return policy, allowing customers to return full-size bottles for a full refund if they aren’t satisfied[2][1].\n- **Scent Variety:** The brand offers a wide range of scents for both men and women, including dupes for cult favorites like Le Labo’s Santal 33 and By Kilian’s Love, Don’t Be Shy[2][1].\n\n### Detailed Comparisons\n\n| Original Luxury Scent        | Dossier Dupe        | Notes from Reviewers                                                                            |\n| ---------------------------- | ------------------- | ----------------------------------------------------------------------------------------------- |\n| Dior Sauvage                 | Aromatic Star Anise | Smelled identical; much more affordable; reviewer switched to Dossier permanently               |\n| YSL Black Opium              | Ambery Vanilla      | Very similar; Dossier’s version is less subtle and doesn’t last as long                         |\n| YSL Libre                    | Floral Lavender     | Indistinguishable in blind tests; reviewers and their partners couldn’t tell the difference     |\n| By Kilian Love, Don’t Be Shy | Floral Marshmallow  | Warm, inviting; reviewer would repurchase even without direct comparison to the luxury original |\n| Le Labo Santal 33            | Woody Sandalwood    | Warm, long-lasting; highly regarded even without side-by-side comparison                        |\n\n### How Dossier Keeps Prices Low\n\n- **Direct-to-Consumer Model:** Eliminates traditional retail markups.\n- **Generic Packaging:** Uses uniform, minimalist bottles and boxes.\n- **No Brand Name Premium:** You pay for the scent and ingredients, not the logo.\n- **Bulk Discounts:** Additional savings for buying multiple bottles[2][1].\n\n### Pros and Cons\n\n**Pros:**\n\n- Affordable alternatives to expensive designer fragrances\n- Vegan, cruelty-free, and sustainably produced\n- Scents are highly accurate to originals\n- Risk-free returns and bulk discounts\n\n**Cons:**\n\n- Generic packaging may not appeal to collectors\n- Some fragrances may not last as long as luxury originals[2][1]\n\n## Expanded Insights\n\n**Performance and Wear:**  \nWhile most Dossier scents receive praise for their longevity, some reviewers note that certain formulas (especially those inspired by lighter or gourmand fragrances) may require midday reapplication. This is typical for Eau de Toilette formulations, but Dossier also offers Eau de Parfum options, which generally last longer[6][9].\n\n**Sustainability and Ethics:**  \nDossier emphasizes clean ingredients and eco-friendly packaging. All products are vegan and cruelty-free, and the brand avoids parabens, phthalates, colorants, and UV filters[9].\n\n**Shopping Experience:**  \nThe buying process is transparent, with each Dossier fragrance clearly labeled with its luxury inspiration. The brand also offers a quiz to help customers find their ideal scent and provides educational content to make fragrance shopping more accessible[9].\n\n**Customer Experience:**  \nMost reviews, both editorial and user-generated, are positive, highlighting the value, scent accuracy, and ethical production. Occasional criticisms focus on longevity and the lack of decorative packaging, but these are generally outweighed by the cost savings and scent quality[2][6][9].\n\n## Conclusion\n\nDossier offers a compelling alternative for fragrance lovers who want the experience of luxury scents without the high price tag. The brand’s fragrances are impressively close to their designer inspirations, ethically produced, and accessible to a wider audience. The main trade-offs are simpler packaging and, for some scents, slightly shorter longevity. For most users, these are minor drawbacks compared to the significant savings and quality offered[2][6][9][1].\n",
      "strength": 0.7199999281000028,
      "metadata": {
        "source": "data/5.md",
        "title": "5",
        "type": "document",
        "file_size": 5405
      },
      "created_at": "2025-07-17T21:04:12.028434",
      "last_accessed": "2025-07-17T21:04:12.028435",
      "id": "pattern_ff8dfccb_1752800747"
    },
    "pattern_0c21d287_1752800652": {
      "content": "Document: 5\n## Summary of the Business Insider Dossier Perfume & Cologne Review\n\n**Dossier** is a New York-based brand, founded in 2018, that specializes in creating affordable, high-quality fragrances inspired b...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/5.md"
      },
      "created_at": "2025-07-17T21:04:12.028476",
      "last_accessed": "2025-07-17T21:04:12.028477",
      "id": "pattern_0c21d287_1752800747"
    },
    "pattern_d4403543_1752800652": {
      "content": "How Gen Z's Favorite Beauty Brands Leverage Influencer Marketing to Drive Sustainable Growth\nLet’s unpack the ingenious strategies behind Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury.\n\nAs we can see from recent trends like ‘de-influencing’, digitally native shoppers like Gen Zers demand honesty and genuine opinions now more than ever before. In fact, 92% of Gen Zers say authenticity is the most important value for them. Following suit, the world’s savviest brands are placing authenticity as a core value in their influencer marketing campaigns.\n\nToday, we’re unpacking how Gen Z’s favorite beauty brands — Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury — are leaning into authentic influencer partnerships to create campaigns that truly resonate with younger consumers.\nRare Beauty\n\nAlthough it was founded by Selena Gomez, Rare Beauty is unlike other celebrity brands. Consumers aren’t buying from Rare Beauty just because they’re big fans of Selena Gomez. Instead, they’re invested in what the mission-driven brand stands for: breaking traditional norms, destigmatizing mental illness, and fostering conversations around hope and agency. These ideas are integrated into every element of Rare Beauty — even its influencer marketing strategies.\n\nUnlike the extravagant influencer trips and parties of other beauty brands, Rare Beauty brings its influencer relationships down to earth by inviting intimate groups of influencers to various wellness retreats where they’re under no obligation to produce content. Rather, they spend the weekend lounging in their comfiest clothes and attending wellness experiences and fireside chats with mental health experts.\n\nFrom a marketer’s perspective, this may seem counterintuitive: if you’re not guaranteed to get content back from influencers, what is the return on investment? But these kinds of community building initiatives are what make a world of a difference when it comes to building a loyal customer base — one that spreads organic word-of-mouth advocacy to their friends (and followers). In fact, Rare Beauty’s unique influencer strategies have allowed it to far outrank other beauty brands in terms of volume of influencer coverage, growing at 110% year-over-year with influencers.\n\nAdditionally, Rare Beauty truly embraces the idea that everyone is an influencer. In May, the brand hosted its first mental health summit, inviting 150 community members — from health and wellness creators like Whitney Simmons to the brand’s most devoted customers — to gather in person, while 50,000 others joined virtually on TikTok from around the world. Again, while attendees weren’t obligated to create content, many still highlighted the event on their own social media accounts, further boosting brand awareness and affinity.\n\nBy investing in its brand community, Rare Beauty has been able to grow at an astronomical rate. A recent survey showed that Rare Beauty ranks second on its list of the top cosmetics brands among Gen Z, and by the end of 2023, Rare Beauty is expected to exceed $300 million in sales — which is triple what it earned in 2022, when sales doubled from 2021.\ne.l.f. Beauty\n\nIn August, e.l.f. Beauty reported its 18th consecutive quarter of sales growth, crediting its social-savvy marketing team for the company’s continued success. On its most recent earnings call, e.l.f. Beauty CEO Tarang Amin talked about the brand’s “disruptive marketing engine,” citing its ability to “generate buzz-worthy moments for our community and reach new audiences with our collaborations.”\n\ne.l.f. Beauty knows how to create viral moments, not only by running unique co-branded promotions with other brands, such as its iconic collaboration with Chipotle, but also by working with a diverse group of creators to varying capacities.\n\nThe brand regularly activates micro-influencers to promote its products on TikTok, then turns their content into ads. But to take its influencer partnerships to the next level, e.l.f. Beauty co-creates entire product lines with popular macro-influencers in the beauty space.\n\nFor example, the brand worked with mega beauty influencer Mikayla Nogueira (15 million followers on TikTok) to create a limited-edition lip liner and lipstick duo in celebration of Mikayla’s wedding. On launch day, the wedding lip kit sold out on the brand’s DTC site within 18 minutes, marking its fastest-ever collection sellout. The collection also helped with brand awareness, as 75% of buyers were first-time customers.\n\nBut it doesn’t stop at TikTok collaborations. Earlier this year, e.l.f. Beauty aired its first Super Bowl ad featuring beloved actress Jennifer Coolidge, who is most recently renowned for her role as Tanya in the hit HBO series, The White Lotus.\n\n‍\n\n‍\n\nThe brand further leveraged their new relationship with Jennifer Coolidge after the Super Bowl, having her star in the brand’s get-ready-with-me YouTube series, “Vanity Table Talks.” e.l.f. Beauty CFO Mandy Fields explained, “[Jennifer Coolidge] is very relevant right now. That’s what we strive to do with our marketing spend. We strive to be culturally relevant and authentically engage with our community.”\n\nStaying on top of trends and being part of cultural zeitgeists has allowed e.l.f. Beauty to seamlessly build a multi-channel influencer marketing program that engages audiences in ways that truly resonate. By doing so, e.l.f. Beauty has been able to experience a minimum of 20% growth in each of the last 18 quarters, with no signs of slowing down.\nCharlotte Tilbury\n\nIt’s no longer just millennials who love Charlotte Tilbury — a growing number of Gen Zers are embracing the brand’s famed products. In fact, according to a recent beauty trends report, Charlotte Tilbury was the most popular beauty brand last year, raking in an astounding 450,000 average monthly searches and a whopping 1.3 billion TikTok views globally.\n\nLike many other millennial-friendly beauty brands that were founded in the early days of social media, Charlotte Tilbury has been ramping up its efforts to adapt to newer platforms and younger audiences. Charlotte Tilbury, the brand’s founder, explained, “I’ve always believed it is essential for us to have an active presence across all channels; each has its own specialities and attracts its own unique audiences that we want to engage with.”\n\nIt’s no wonder the brand takes a full-funnel approach to influencer marketing, running a variety of activations at the same time. Here are just some of Charlotte Tilbury’s ingenious strategies:\n\n    Traditional influencer program: With a focus on video content, Charlotte Tilbury’s influencer partners produce makeup tutorials and get-ready-with-me style videos for Instagram, Facebook, and TikTok. This type of content is high-performing and extremely effective, because audiences can watch as creators apply the makeup and see which product sets to purchase to achieve each look. The brand then takes these influencer-generated videos and repurposes them as paid ads across various social channels.\n\n    Affiliate program: The Charlotte Tilbury Affiliate Program allows creators to earn commissions every time someone purchases from Charlotte Tilbury’s website using the creator’s unique affiliate code, which they typically share on their Instagram Stories. The code allows their followers to get a 15% discount, and affiliates themselves can receive discounts of up to 30% on products. Plus, affiliates gain access to VIP products and more. This attractive affiliate model has allowed the brand to build a strong community of affiliates and an effortless revenue-generating machine — all without breaking the bank.\n\n    Product seeding: Charlotte Tilbury often runs product seeding campaigns, sending PR packages and gifts to influencers, which include a selection of their popular products. With Instagram-worthy packaging and exciting new launches, these packages encourage influencers to try the products and share about them with their followers in organic content, such as unboxing videos, tutorials, and reviews.\n\n    Celebrity brand ambassadors: For years, Charlotte Tilbury has leveraged celebrity endorsements from the likes of Kate Moss, Blake Lively, Drew Barrymore, and Twiggy — particularly for their Pillow Talk product line. In March of this year, the brand also announced its partnership with Gen Z’s favorite supermodel, Bella Hadid, as the official face of the brand. The Charlotte Tilbury team has been known to nurture these partnerships with the celebrities in their network, regularly sharing exclusive behind-the-scenes content from high-profile, star-studded events.\n\nBy implementing a full-funnel influencer marketing strategy, Charlotte Tilbury effectively guides consumers from initial awareness through to conversion and even post-purchase engagement, maximizing the impact of their influencer program across the entire buyer’s journey.\n",
      "strength": 0.7199999281000028,
      "metadata": {
        "source": "data/2.md",
        "title": "2",
        "type": "document",
        "file_size": 8900
      },
      "created_at": "2025-07-17T21:04:12.029053",
      "last_accessed": "2025-07-17T21:04:12.029054",
      "id": "pattern_d4403543_1752800747"
    },
    "pattern_1e28f45c_1752800652": {
      "content": "Document: 2\nHow Gen Z's Favorite Beauty Brands Leverage Influencer Marketing to Drive Sustainable Growth\nLet’s unpack the ingenious strategies behind Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury.\n\nAs we can ...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/2.md"
      },
      "created_at": "2025-07-17T21:04:12.030751",
      "last_accessed": "2025-07-17T21:04:12.030751",
      "id": "pattern_1e28f45c_1752800747"
    },
    "pattern_118d7167_1752800652": {
      "content": "Dossier review: These under-$50 designer fragrance dupes will replace your expensive originals\nWritten by Amir Ismael edited by Maiya Pascouche\nWhen you buy through our links, Business Insider may earn an affiliate commission. Learn more\nA side-by-side collage with Dossier perfumes on the left and Dossier colognes on the right.\nThree of the Dossier fragrance dupes we tried next to their luxury counterparts. Sally Kaplan/Amir Ismael/Insider\nUpdated Dec 8, 2023, 5:53 PM ET\nSave Saved\n\nWhile luxury brand perfumes and colognes may be of higher quality than the watered-down body mists of our youth, high-end fragrances are often marked up astronomically. Alongside quality ingredient costs, you also end up paying for the brand name, packaging, and the extravagance associated with it.\n\nThankfully, Dossier is the solution for those who simply cannot afford or want to spend luxury prices on perfume. Founded in 2018, Dossier is a New York-based brand specializing in recreating popular high-end fragrances at an accessible price point. All of Dossier's perfumes are vegan, cruelty-free, and sustainably produced. Starting at just $19, you'll find scents inspired by brands like YSL, Le Labo, Chanel, Gucci, Tom Ford, Maison Margiela, and many more.\nAromatic Star Anise\nDossier Aromatic Star Anise\nCheck price at Walmart\nCheck price at Dossier\nDossier Ambery Vanilla\nDossier Ambery Vanilla\nCheck price at Walmart\nCheck price at Dossier\nDossier Floral Lavender\nDossier Floral Lavender\nCheck price at Walmart\nCheck price at Dossier\nThe verdict on Dossier\n\nThree members of the Insider Reviews team tested a variety of Dossier fragrances, and we unanimously agreed that the overall quality and value were high and the perfumes were spot on to their luxury counterparts. Even our loved ones, who are familiar with the fragrances we wear regularly, couldn't tell the difference. Keep reading to learn more about the specific Dossier perfumes we reviewed.\nDior Sauvage vs. Dossier Aromatic Star Anise\nA bottle of Dior Sauvage cologne and Dossier Aromatic Star Anise cologne side-by-side on a table.\nAmir Ismael/Insider\nAromatic Star Anise\nDossier Aromatic Star Anise\nCheck price at Walmart\nCheck price at Dossier\n\nOne of the most significant benefits of shopping at Dossier is getting your favorite scents for far less than the authentic brand name version. Dior Sauvage Eau de Toilette is one of my favorite fragrances, but at $100 for a 2-ounce bottle, I don't like to use it every day. I tried Dossier Aromatic Star Anise, which is the brand's interpretation of Dior Sauvage, and it smelled identical.\n\nAt $29 for a 1.7-ounce bottle, I'm not as reserved with how often I spray it. I can buy three bottles from Dossier for the price of one from Dior. Once I finish my current bottle of Dior, I will not replace it with another. With Dossier Aromatic Star Anise, I have no reason to. — Amir Ismael, Insider Reviews senior reporter\nYSL Black Opium vs. Dossier Ambery Vanilla\nThree bottles of Dossier perfumes on a white surface.\nKayla Bickham/Insider\n\nDossier Ambery Vanilla\nDossier Ambery Vanilla\nCheck price at Walmart\nCheck price at Dossier\n\nYSL Black Opium (usually $95 an ounce) was my first introduction to perfumes after I grew out of body sprays as a teen. Learning the hard way what it means to put on too much perfume has now permanently engraved its rich vanilla scent into my brain. After years and years of wear, I know Dossier's Ambery Vanilla is its sister scent without even having a bottle of YSL Black Opium of my own anymore. A yummy fall scent is the best way to describe what both bottles smell like. However, there's a difference or two that sets the two scents apart.\n\nThere's something about the warmth of YSL's take on a seductive vanilla that's a bit more subtle than its dupe from Dossier. While the spicy gourmand is at the forefront of both perfumes, the vanilla sneaks up and takes over once settled on the skin in Black Opium, while Ambery Vanilla is more of a mix of the two scents it's named after. Although the licorice and black coffee notes linger a bit long in Ambery Vanilla, the perfume itself doesn't last all day. — Kayla Bickham, Insider Reviews style and beauty fellow\nYSL Libre vs. Dossier Floral Lavender\nA bottle of YSL Libre and Dossier Floral Lavendar perfume on a marble surface.\nSally Kaplan/Insider\n\nDossier Floral Lavender\nDossier Floral Lavender\nCheck price at Walmart\nCheck price at Dossier\n\nI tested Dossier's dupe for YSL Libre perfume, which I wore on my wedding day and use for many special occasions. My wife couldn't tell the difference at all, and I could barely tell myself after 2 years of using YSL! I also tested several other fragrances against their original inspirations and had the same reaction to each of them. I will never order expensive perfume again — I don't know how or why Dossier didn't exist sooner! — Sally Kaplan, Insider Reviews executive editor\n\nImmediately after I began testing Dossier, my girlfriend ordered a few dupes of fragrances in her collection — one of which also being YSL Libre. I did a blind side-by-side smell test, and I, too, can confirm that YSL Libre and Dossier's Floral Lavender smell exactly the same. — Amir Ismael, Insider Reviews senior reporter\nOther Dossier men's fragrances\nFive bottles of different Dossier men's colognes on a table.\nAmir Ismael/Insider\n\nDossier Spicy Vanilla Cologne\nDossier Spicy Vanilla\nCheck price at Dossier\nDossier Musky Oakmoss\nDossier Musky Oakmoss\nCheck price at Walmart\nCheck price at Dossier\nDossier Aquatic Lime\nDossier Aquatic Lime\nCheck price at Walmart\nCheck price at Dossier\nDossier Citrus Ginger\nDossier Citrus Ginger\nCheck price at Walmart\nCheck price at Dossier\n\nI was so happy with how closely Dossier matched the Dior fragrance I already had, I decided to try a few scents that I didn't own. I've always liked to try new scents, but more often than not, steep prices turned me back to the fragrances that I already knew I liked.\n\nAlthough I received a few samples for the purpose of this review, I've already purchased a few extras myself.\n\nI tried Spicy Vanilla, Musky Oakmoss, Aquatic Lime, Citrus Ginger, and Woody Sandalwood, and while I like some more than others for daily wear, I like having options at a low cost. I might not have a familiar point of comparison for most of the Dossier fragrances in my collection. Still, it sure beats spending upwards of $1,000 on brands like Creed, Tom Ford, Chanel, and Giorgio Armani to create the same variety. — Amir Ismael, Insider Reviews senior reporter\nOther Dossier's women's fragrances\nDossier Floral Marshmallow\nDossier Floral Marshmallow\nCheck price at Walmart\nCheck price at Dossier\nA bottle of Woody Sandalwood cologne.\nDossier Woody Sandalwood\nCheck price at Walmart\nCheck price at Dossier\n\nI also opted to try Dossier's Floral Marshmallow (a dupe of By Kilian's Love, Don't Be Shy) and Woody Sandalwood (inspired by Le Labo Santal 33). Both are scents on the warmer side. While I don't have the luxury versions to compare the scents to, I would happily repurchase both fragrances. I still fight the urge to apply more mid-day. — Kayla Bickham, Insider Reviews style and beauty fellow\nHow does Dossier maintain affordable prices?\nA newly opened box of a Dossier fragrance in unbranded and low-cost packaging.\nAmir Ismael/Insider\n\nAs consumers, we've been conditioned to expect premium colognes and perfumes to cost a lot. Purchasing a high-end fragrance is looked at as a luxury splurge but never as a simple part of your grooming routine. So, naturally, the first thing new customers want to know is how Dossier can make these so cheap.\n\nFirst and foremost, there is no substantial retail mark-up because of the brand's direct-to-consumer model. The brand also limits costs by using generic packaging. All of the bottles are made from 100% recycled glass and come in a 100% recycled cardboard box. However, by far, the most noteworthy cost-saving is the generic branding. There's no inflated cost because there's no luxury brand name on the bottle. When you buy a bottle of Dossier, you're just paying for the same high-quality ingredients used by designer brands, Dossier's affordable packaging, and a profit margin, which is expected for any business.\n\nDossier also has a buy more, save more deal to save you additional money. Buy three items from $78 and get 10% off; buy four items from $99 and get 15% off; or buy five or more items from $116 and get 20% off. You'll also get free shipping on three or more items.\nDoes Dossier perfume last?\n\nIn former Business Insider Reviews style & beauty fellow Kayla Bickham's experience, Dossier's Ambrey Vanilla perfume did not last all day long. However, her tip to stretch all perfumes is to apply them fresh out of the shower, air dry, and then lock the scent in under a body lotion.\nCons to consider\n\nThe only point that might deter some people from Dossier is the generic packaging. If you enjoy collecting unique bottles to display on your vanity or bathroom countertop, you won't be able to accomplish that with Dossier. If you're okay with all of your bottles looking similar — and the tremendous amount of money you'll save — then there shouldn't be anything stopping you from buying Dossier. And if our reviews of Dossier compared to popular fragrances aren't enough to convince you, try it for yourself. Dossier's risk-free returns allow you to try fragrances and send back full-size bottles for a full refund with no questions asked.\nThe bottom line\n\nOverall, we can't recommend Dossier enough for anyone looking for affordable cologne or perfume. We each tried scents that mimic name-brand fragrances that we know and love and were impressed with how close they match.\n\nNot only will you save money on popular fragrances you're already familiar with, but shopping at Dossier will empower you to explore new scents.\n",
      "strength": 0.7199999281000028,
      "metadata": {
        "source": "data/3.md",
        "title": "3",
        "type": "document",
        "file_size": 9880
      },
      "created_at": "2025-07-17T21:04:12.031969",
      "last_accessed": "2025-07-17T21:04:12.031970",
      "id": "pattern_118d7167_1752800747"
    },
    "pattern_2161f667_1752800652": {
      "content": "Document: 3\nDossier review: These under-$50 designer fragrance dupes will replace your expensive originals\nWritten by Amir Ismael edited by Maiya Pascouche\nWhen you buy through our links, Business Insider may ear...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/3.md"
      },
      "created_at": "2025-07-17T21:04:12.035442",
      "last_accessed": "2025-07-17T21:04:12.035443",
      "id": "pattern_2161f667_1752800747"
    },
    "pattern_482690dc_1752800652": {
      "content": "The L in GTL\n\nHere is another idea to get you thinking about selling to women with a repeat consumable product. Not quite the same as press-on nails, but similar – laundry detergent, specifically the concept of elevating every day routines to luxury experiences. Are the margins super amazing? Maybe not lights out, think gross of 50-70% with a net in the 25% plus range, depending on how you set up your pipeline (heavy emphasis on robotics here, more on that later). And.\n\nThe nexus here is a repeat consumable. Set it on subscribe on Amazon and forget it. Got no worries about competition because this is the new reality (Luxury everyday experiences)\n\nSource\nIdeal Customer\n\nWe are creating a fragrance-driven laundry brand targeting style-conscious women aged 25-45 (sweet spot likely in the 28-38 year range) in major metro areas in the $50-150k/year household income bucket, who are active on cleantok, where mundane chores are presented as luxury rituals. Other things to look for are “quiet luxury” products marketed as items gate kept from the general public, example here (Source).\nCase Study\n\nTyler Glamorous Wash went cult almost “overnight” on cleantok with its “Diva” product a couple of years back. (Reminder: Is this outside of your wheelhouse? Use AI to help you track and understand these trends.). Tyler Candle Company made a mini version of their laundry detergent available, got a few influencers involved, and little by little, the UGC inertia took over.\n\nSource\n\nHere is a link to the full “gift set” like you would see for cosmetics or fragrances, not smaller bundles are available and take note that the bottles themselves are not particularly high end packaging, but the names are very intentional here for the different fragrances: Wishlist; Diva; Icon; High Maintenance; Limelight; Entitled; Trophy. (Source)\n\nThis product is still cranking years later, with over 5,000 of this SKU sold in the past month on Amazon (32 oz version). Read the reviews – women are asking about this at the salon when their hair is washed and the smell towels being used, they are smelling clothes moms are bringing to school and immediately adding to cart when they find out what it is. Sure, that strong of a scent might be too strong for some, but it does not matter. Niche auto buy is the play here via referrals.\n\nSource\n\nTwo others to mention here – Dedcool (Source) and Dirty Labs (Source) have followed similar playbooks, but with different aesthetics (cool girl and eco friendly dish focus).\n\nSource\n\nSource\nRoad Map\n\nSo we know what we are selling and to whom, let’s test some demand before we do anything else, shall we? To do that, we need a creative mock up and some branding. You can use Canva, or our favorite AI tool. Here is what I got in one try asking for some high end branding ideas based on fragrance house branding. It came up with the labeling, names and designs. My exact request was: “Create a sensory, elegant brand world where each scent evokes a distinct experience—much like high-end perfume houses (e.g., Le Labo, Byredo).”\n\nIs this perfect? Nope, but it doesn’t matter. Let’s get the copy it generated too for a quick landing page we will throw together too.\n\n1. Cashmere Blossom\n\n   Tone: Elegant, powdery floral\n\n   Label Copy:\n\n“A soft caress of blooming petals wrapped in the warmth of sunlit cashmere. Romantic and effortlessly refined.”\n\n    Color Scheme: Blush pink with rose gold foil\n\n    Symbol: Watercolor petal motif or abstract textile weave\n\n2. Midnight Peony\n\n   Tone: Seductive, deep floral\n\n   Label Copy:\n\n“An evening bloom steeped in mystery—velvety peony, whispers of dark plum, and a trace of vanilla smoke.”\n\n    Color Scheme: Matte plum with copper foil\n\n    Symbol: Peony silhouette with crescent moon overlay\n\n3. Golden Linen\n\n   Tone: Clean, warm, sun-drenched\n\n   Label Copy:\n\n“A sunlit embrace of clean linen, warmed by golden amber and softened with sandalwood musk.”\n\n    Color Scheme: Cream + gold accents\n\n    Symbol: Geometric weave pattern or golden thread motif\n\n4. Seaside Neroli\n\n   Tone: Crisp, aquatic citrus\n\n   Label Copy:\n\n“Breezy neroli blossoms and salt-kissed citrus—like a coastal breeze through white cotton sheets.”\n\n    Color Scheme: Soft aqua + pearl white\n\n    Symbol: Nautical line drawing or droplet\n\n5. Elysian Drift\n\n   Tone: Airy, dreamlike\n\n   Label Copy:\n\n“A celestial veil of lavender and almond flower drifting through clouds of whipped iris and musk.”\n\n    Color Scheme: Lavender mist + silver\n\n    Symbol: Abstract wing or constellation pattern\n\n🖋 Label Design Elements\n\n    Bottle: Refillable minimalist bottle (semi-opaque frosted finish)\n\n    Typography: Serif for scent name + sans-serif for description\n\n    Material: Soft-touch label or embossed linen paper for tactile elegance\n\n    Optional Features: QR code linking to a “scent journey” playlist or scent origin story\n\n📌 Strategic Notes\n\n    Each label should feel like part of a perfume bottle meets interior décor object.\n\n    Avoid clutter—luxury is space, breath, and clarity.\n\n    Make each bottle Instagrammable in a shelfie or laundry ritual video.\n\nWhen we dive in for some tagline ideas, here is what it came back with (note, I’m literally only a few clicks into brainstorming here, this is not high intensive effort by any means).\n\nTagline Development:\n\n    \"Elevate Every Wash\" - Action-oriented, aspirational\n\n    \"Indulge Your Senses, Refresh Your World\" - Sensory focus\n\n    \"Where Clean Meets Couture\" - Luxury positioning\n\nVisual Identity System:\n\n    Color Palette: Soft, elegant hues (blush pinks, muted golds, creamy whites)\n\n    Typography: Modern serif or script fonts for feminine, high-end appeal\n\n    Logo Design: Minimalist with subtle luxury cues\n\n    Package Design: Sleek bottles with metallic accents and embossed details\n\nScent Storytelling and Product Naming\n\nFragrance Narrative: Each scent should tell a story that transports customers:\n\n    \"Cashmere Blossom\" - Luxury textile meets delicate florals\n\n    \"Midnight Peony\" - Sophisticated evening elegance\n\n    \"Golden Linen\" - Warmth, comfort, and refined luxury\n\nScent Description Writing: Create immersive, perfume-style descriptions:\n\n    Use sensory language that evokes emotions and memories\n\n    Reference luxury experiences and aspirational lifestyles\n\n    Include suggested use occasions and mood settings\n\n    Connect fragrance to lifestyle and home aesthetics\n\nBrand Voice & Messaging\n\nTone and Communication Style:\n\n    Warm, inviting, and empowering\n\n    Aspirational but accessible\n\n    Community-focused and inclusive\n\n    Sophisticated without being pretentious\n\nCore Messaging Pillars:\n\nSelf-Care and Ritual: \"Transform laundry into a moment of self-indulgence. Every wash becomes a ritual of care for yourself and your home.\"\n\nHome as Sanctuary: \"Your signature scent for your sanctuary. Create a home environment that reflects your personal style and sophistication.\"\n\nSustainability with Luxury: \"Luxury that loves the planet. Premium quality without compromise to environmental values.\"\n\nCommunity and Sharing: \"Join a community of women who understand that life's everyday moments deserve extraordinary care.\"\n\nAlright then, now that we have the copy, you can generate a quick landing page you put up on a quick site (hint, ask AI again to generate and preview a landing page based on one of the brands listed above, I used dedcool), snippets below. Again, this doesn’t matter, just have something as a placeholder you can iterate on later. Snag the html from your AI, get a domain on namecheap or similar, set up your minimal hosting, you are off to the races. Ideal spend here is not heavy, maybe a few USTT for a domain and the cheapest hosting plan/email set up you are comfortable with.\n\nOnto ads, this is going to take some research, but AI can do this for us too, as I’ve talked about in the past.\n\nFirst, create your handles – tiktok, Instagram and pinterest.\n\nRemember, the idea here is to test demand, we want to get a list of emails of “besties” who “want in” when we are “back in stock”.\n\n    Target women ages 25-45 in major urban areas\n\n    Layer interests: luxury lifestyle, interior design, premium beauty\n\n    Use TikTok In-Feed ads and Spark ads for cost-effective reach\n\n    Focus on authentic, user-generated content style\n\nSource\n\nCopying here for those who want to view it on Substack. Can replicate this yourself on any other “luxury everyday experience” trend that fits your style\n\nKey Viral Luxury Laundry Ads and Trends on TikTok\n\n    #BestLuxuryLaundryDetergent\n\n        This hashtag is associated with over 46 million posts, indicating a massive interest in luxury laundry products among TikTok users (Source). Videos under this tag often showcase premium detergents with exotic scents, stylish bottles, and influencers sharing their personal favorites.\n\n    Creator Highlights\n\n        Sapphiredelight: A video titled “Luxury Laundry Detergent: A Fragrant Obsession” received 87,400 likes and nearly a thousand comments, emphasizing the allure of high-end laundry scents (Source)\n\n        The Crazy Cleaning Lady 22: Her video on “Luxury and Modern Laundry Detergent for Tropical Scent Lovers” highlights the appeal of unique, vacation-inspired fragrances in luxury laundry care (Source)\n\n        SouthernBelle: Uses the hashtag #luxurylaundrydetergent and posts videos that blend laundry care with a sense of luxury, appealing to viewers who want to elevate their everyday experiences (Source)\n\n    Trending Scents and Comparisons\n\n        LUXE Scent: Multiple creators, such as at barndowife at mkbenn and , have posted videos raving about luxury laundry detergents in the “Luxe” scent, comparing them to other high-end laundry products (Source)\n\n        Diva Wash Comparisons: The hashtag “Luxury Laundry Detergent That Smells Like Diva Wash” is associated with over 36 million posts, showing the popularity of this specific scent comparison (Source)\n\n    TikTok Shop Laundry Detergent Campaigns\n\n        TikTok Shop features luxury laundry detergent products, with ads and videos that highlight the best-smelling and most luxurious options available for purchase directly on the platform (Source)\n\n        These campaigns often use influencer partnerships, user-generated content, and seamless shopping integrations to drive engagement and sales (Source)\n\n    What Makes These Ads Viral?\n\n        Scent-Driven Content: Videos focus on the sensory experience, with creators opening bottles, sniffing clothes, and describing the fragrance as if it were a luxury perfume\n\n        Lifestyle Aspiration: The ads and videos position luxury laundry detergent as a way to elevate daily routines, appealing to viewers’ desire for self-care and indulgence\n\n        Interactive and Relatable: Influencers and everyday users share their genuine reactions and routines, making the content feel authentic and relatable\n\n        Hashtag Challenges and Trends: Hashtags like #luxurylaundrydetergent and #laundrytok help these videos reach a wider audience and encourage user participation\n\n    Ad Format Strategy:\n\n        Short-Form Video (10-15 seconds): Mix still images with video transitions\n\n        Multiple Faces: Show diverse users to increase relatability\n\n        Lifestyle Integration: Beautiful home settings with aspirational feel\n\n        Sensory Focus: Highlight luxury packaging and fragrance experience\n\n    Hook Development: Lead with captivating text overlay or voiceover in first 2 seconds:\n\n        \"The secret to making your home smell unforgettable—revealed\"\n\n        \"Why luxury hotels always smell amazing (and how to get it at home)\"\n\n        \"The laundry hack that turned my routine into self-care\"\n\nSuccess leaves instructions clues, anon. Follow them.\n\nTake these ads above as inspiration and create your own, based on the guidelines above, use AI and ask it to show you how to use Canva or Capcut if you are not already familiar.\n\nNow for spend, your mileage may vary, but generally CPCs on TikTok for me land in the $0.17-$1.00 range, with an average between $0.50 and $1.00. Assume a max conversion of 20%, and I’m at a CPL of $2.50 on the low end and $5 on the high end. Usually I am in the ~$500 spend range to get opt ins for a list started, so I’m expecting 100-200 leads based on that budget, assuming my creatives are landing and my influencer targeting was correct, which is why the intel above from AI is so useful. Again, not super in the weeds here, maybe 20 minutes into this project, and I have already identified a roadmap, basic branding ideas, gotten a simple landing page up, and created an ad plan.\n\nThe iteration will take time, not forever, but approval usually takes a day, and then the algo needs a day or three to figure out your target demo, which is why using influencers from the jump can be so helpful. Give yourself at least a week to collect intel before pivoting, I’d start at $50 ad spend per day initially, and if you are gaining traction, start to ratchet up. This is why I said under $1k at the jump, you want breathing room here in case you hit something that is working. Worst pain in life is seeing something taking off and not being able to have the runway for it to fully take flight. Even assuming $500 initial ad spend, and de minimis costs on the domain/landing page set up, you should still have a decent buffer to pivot with here before reaching the four figure mark.\n\nSo you let your ads run, you are gaining traction with your influencers and you have a solid list of interested customers, congratulations! Now we can move onto formulation/production.\nRise of the Machines\n\nThanks to Tyler’s line and their Diva product, we know what scent profile and formulation our target customer likes. This makes it rather straight forward from a formulation perspective. I personally would not only have a “Diva” equivalent, but also another mini trial set for optimal virality on UGC. The key here is two fold – the use of robotics and avoiding tariff noise. Here is how we do that at the time of this writing.\n\nLuxury laundry detergents are ideal candidates for robotic manufacturing due to precision requirements in formulation and packaging (e.g. precise ingredient measurement for consistent fragrance profiles, automated pH and viscosity control, scalable production, et al).\n\nWhy Mexico?\n\nTariff Benefits:\n\n    Duty-free export to U.S. under USMCA for compliant goods\n\n    Exemption from 25% U.S. steel tariffs for Mexican-sourced materials\n\n    PROSEC program reduces input tariffs for export-oriented manufacturing\n\nCost Advantages:\n\n    Approximately 70% lower labor costs compared to U.S. manufacturing\n\n    3-5 day shipping to U.S. markets versus weeks from Asia\n\n    Advanced manufacturing infrastructure with skilled workforce\n\nSupply Chain Resilience:\n\n    Reduced dependency on Asian supply chains\n\n    Proximity enables rapid response to viral demand spikes\n\n    Simplified logistics for North American distribution\n\nNow then, who could we use for our project? Here is a list below. Keep in mind these facilities are hybrid, meaning robotic formulation with semi-automated packaging. Note, again, this is all compiled with AI’s help.\n\nTop Mexican Maquiladoras for Detergent Formulation\n\nEUROCHEM\n\n    Specializes in cleaning and specialty treatment chemicals\n\n    Focus on green technology and industrial cleaning solutions\n\n    Strong capabilities in custom detergent formulation\n\n    Ongoing expansion in cleaning products sector\n\nHJB Química Internacional\n\n    Over 15 years of chemical manufacturing experience\n\n    Supplies raw materials and finished products for household sectors\n\n    Expertise in surfactants and fragrance components\n\n    Established relationships with personal care industry\n\nAromáticos y Químicos del Centro\n\n    High-quality fragrance and chemical manufacturing\n\n    COFEPRIS regulated with extensive compliance experience\n\n    Specialized in home and personal care industry supply\n\n    Strong fragrance development capabilities\n\nDesarrollo de Especialidades Químicas\n\n    Established in 1986 with proven track record\n\n    Specializes in high-quality chemical products and laboratory reagents\n\n    Tailored solutions for research, analysis, and industrial processes\n\n    Experience in detergent manufacturing and development\n\nNostalxico S de RL de CV\n\n    Leading detergent soap supplier in Mexico by export volume\n\n    Substantial experience in laundry detergent manufacturing\n\n    Established export relationships and logistics networks\n\n    Strong candidate for maquila partnership arrangements\n\nAnd from there, we’d set up a 3PL, ideal candidates would be many of the usual suspects, although Shipbob and I have not always had the best relationship, YMMV, and Amazon would get a mention here too eventually.\n\nShipfusion\n\n    Strengths: 99.9% order accuracy, white-glove service specialization\n\n    Ideal For: High-value products requiring precision handling\n\n    Key Benefits: Premium fulfillment experience, advanced tracking\n\nBuske Logistics\n\n    Strengths: Century-old expertise in luxury home goods\n\n    Ideal For: Brands prioritizing elegance and security\n\n    Key Benefits: Established luxury market experience, premium handling\n\nZendbox\n\n    Strengths: Specializes in luxury unboxing experiences\n\n    Ideal For: International expansion, particularly UK/EU markets\n\n    Key Benefits: Global fulfillment network, premium presentation focus\n\nShipBob\n\n    Strengths: Cost-effective for startups, 2-day shipping capabilities\n\n    Ideal For: Early-stage brands balancing budget and scale\n\n    Key Benefits: Rapid scaling support, competitive pricing\n\nIdeally 3PL is a set and forget situation, but more than likely, there will need to be adjustments made here. And for those who may not be aware, at a high level, the pricing for these usually works out to be:\n\n    Fulfillment Fees: $3-$5 per order for standard packaging\n\n    Premium Packaging: Additional $1-$2 for custom branded materials\n\n    Storage Fees: $0.50-$1.50 per cubic foot per month\n\n    Integration Costs: One-time setup and ongoing management fees\n\nOnce you have these legos in place, you can turn your ads back on and start the machine running in earnest.\n\nAll of this took me about a half hour to spec out. Not saying I’m a genius by any stretch, just muscle memory and looking into an opportunity I see gaining more and more traction.\n\nSide note, some tools I should mention, as you guys know I am always tinkering with workflows. I’ve found the below helpful.\n\n    VAs for me are largely a thing of the past. I’ve replaced almost all of my Bangladeshi friends with a version of open source Claude desktop, MCP and puppeteer\n\n    Product dev for apps and such is still really heavy Cursor for me. I play the Claude vs ChatGPT game getting them to one up each other with the best prompt for a certain task for Cursor, and either make sure I spec it out in Tempo first if need be, or go straight to Cursor\n\n    Testing - Source and Source\n\n    Feedback and analytics - Source and Source\n\n    Customer/user intelligence - Source\n\n    Still testing - Beacon - No recommendation at this point on this one just a *potential* tool\n\nBut then again, what do I know? I’m just a cartoon mouse who can’t even find a tent these days.\n\nBack to the sewer.\n\nIn Conclusion\n\nGrateful once again to BTB for giving me the space to write here. Hope you found this helpful, you can find me sometimes posting/RT-ing on X FKA Twitter The_CryptoMouse\n\nAs always, shoot me a DM if you find yourself stuck, always happy to help out the jungle. Will do my best to catch up as quickly as I can on DMs, and make sure you are on my mailing list.\n",
      "strength": 0.7199999281000028,
      "metadata": {
        "source": "data/4.md",
        "title": "4",
        "type": "document",
        "file_size": 19686
      },
      "created_at": "2025-07-17T21:04:12.037243",
      "last_accessed": "2025-07-17T21:04:12.037244",
      "id": "pattern_482690dc_1752800747"
    },
    "pattern_1be66c86_1752800652": {
      "content": "Document: 4\nThe L in GTL\n\nHere is another idea to get you thinking about selling to women with a repeat consumable product. Not quite the same as press-on nails, but similar – laundry detergent, specifically the ...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/4.md"
      },
      "created_at": "2025-07-17T21:04:12.048479",
      "last_accessed": "2025-07-17T21:04:12.048480",
      "id": "pattern_1be66c86_1752800747"
    },
    "pattern_1fe3c3b5_1752800652": {
      "content": "First off, I would like to thank BTB for allowing me to use their platform to share my story. If it wasn’t for them and the entire community they built, I would probably be a poverty-stricken gym teacher. Thank you for sending the ladder down.\n\nNow for the journey of PreSleep.\n\nPreSleep may seem “new” to most of you reading this, but the journey began over a year ago when I was a broke college senior.\n\nI subscribed to BTB, and I started investing in BTC and ETH, thinking I’m well on my way to Degen Island.\n\nOnly to soon realize that even a 20x moonshot on $1,000 of ETH wasn’t going to make a life changing difference.\n\nI began to notice every other post wasn’t just about crypto. It was about starting a business and how to create multiple income streams that make money while you sleep.\n\nI knew absolutely nothing about Ecom, marketing, sales, logistics, website design, or copywriting. You name it; I didn’t know how to do it. College certainly didn’t.\n\nAll I knew was that I had to start.\nThe Idea\n\nAs a college athlete, I had to wake up at 5am daily for morning workouts. This schedule was really taking a toll on my sleep.\n\nI turned to melatonin, which would help me fall asleep, but I never reached quality sleep. I would feel like I had been hit by a truck when I woke up in the morning. Not ideal when going to lift at 5am.\n\nI began to do some research and realized there were better ingredients that I could use to get quality sleep. As I dug deeper, I found that most sleep supplements thought leaders were using:\n\n    Magnesium\n\n    Glycine\n\n    L-theanine\n\nI started taking these supplements, and I noticed my sleep got significantly better. I felt much more refreshed when I woke up.\n\nI couldn't find a product that had all of these ingredients together in efficacious doses. Then it hit me.\n\nWhy not make it into an all-in-one formula that you could drink and that tasted good? Liquid supplements will also dissolve faster and, in turn, absorb quicker. This process allows the liquid supplement to work faster than pills.\n\nThis is when the idea for PreSleep was born. I knew I had a lot of work to do to get this going. I paid someone on Fiverr 70 dollars to do my logo, and I got my LLC up that same week. I was off to the races. Please don’t overthink this part.\nDemand Test or Lack Thereof\n\nAfter reading Efficiency by BTB, I knew the optimal way to test demand would be:\n\n    Set up a landing page\n\n    Run ads to the page\n\n    See if you get sales\n\n    If you don’t get any sales, abandon the product or adjust copy, creative, etc\n\nI didn’t do any of that. I was broke and had $1,000 to my name because I was still in college. Instead, I devised a balling on a budget demand test.\n\nI decided my version of a demand test would look something like this:\n\n    Buy the ingredients of PreSleep in bulk and blend them myself\n\n    Cold outreach to Instagram influencers via DMs\n\n    Send the homemade version to Instagram influencers\n\n    Ask them to post and drive traffic to my email list\n\nIt wasn’t perfect by any means, but after doing influencer outreach every day for the month of January, here were the results, by February:\n\n    I got calls from a professional sports team to buy PreSleep for the whole team\n\n    I had multiple influencers who had positive reviews\n\n    107 email subscribers\n\n    My DM’s were loaded with people begging me to launch\n\nAt this point, I had enough confidence to feel that the idea was validated and could be scaled. My dad had taken notice of how much work I had been putting in day in and day out.\n\nHe was also using the homemade version of PreSleep every night and loved it from the very beginning. He felt comfortable funding the initial capital for inventory from an FDA approved supplier to get me started.\n\nPreSleep was finally moving from my parents kitchen blender to a real production operation.\nNavigating the Manufacturing Side\n\nWhat I should’ve done:\n\nThis is something I wish I had done a better job of selecting, to be completely honest. Many headaches would’ve been saved if I had selected a better supplier from the beginning.\n\nThe best way to find manufacturers is NOT through Google.\n\nThere are some quality manufacturers in the USA, but they are extremely hard to find unless\n\n    You have an existing relationship with a supplier\n\n    You get a referral\n\n    Hire a consultant to help with this\n\nIf you are looking to find a manufacturer, I highly recommend working with someone who has a wealth of knowledge in the space.\n\nI used Blue Ocean Advisory to help me find a new supplier, and it has saved me so much time and energy.\n\n_Not affiliated, I just think they do a great job._\nThe Launch or the Splatt\n\nAfter working for 7 months straight, seeing no results, the hard work finally paid off, and I made $1,700 that first month. At the time, I was ecstatic, but that excitement would be short lived.\n\nBecause here’s how the next few months of revenue went:\n\n    Sept: $1200\n\n    October: $900\n\n    November: $850\n\nRuh roh! Not a great trend, kind of like when a shitcoin launches and slowly fades into irrelevance.\n\nAt the time, all sales were coming from one channel: organic TikTok content.\n\nI learned this entirely through BowTiedTikTok’s discord.\n\nNote: If it hadn’t been for joining BowTiedTikTok’s discord, I wouldn’t have sold any units, so shout out to him for coaching me through creating viral videos. I mainly use his discord now to find quality UGC creators. Check out his discord here _Disclaimer_: This is an affiliate link because I believe in capitalism, and you should too.\n\nAnyway, back to PreSleep. This whole 4-month period was the largest gut punch since starting the business.\n\nAt this point, I was out of college and working a full time job as an SDR, doing the typical 9-5 grind of ripping dials and hustling meetings.\n\nOnce I was off the clock, I’d begin to grind out work for the business, and during that period of time, it was mostly working on getting more eyeballs on the product by creating TikTok content.\n\nThe bulk of the time would be spent creating TikTok videos every night until 1am or later.\n\nI spent everything I earned at my W2 on PreSleep and reinvested all of the small profits back into the business.\n\nI hardly saw any results. I would get a sale every other day if I was lucky. I’ve had my fair share of 0 sales days/weeks which would only add to my stress and anxiety.\n\nI desperately spent $4,000 on TikTok creators to help promote PreSleep. That turned out to be a total waste of money.\n\nI honestly thought about quitting every day. I had so many negative thoughts swirling around my head.\n\nIs this the right niche? Am I working on a lost cause? Does my product suck? Do I suck at this? Did I waste my dad’s money? Why didn’t I do a proper demand test like BTB said!\n\nAt this rate, I wouldn’t sell out of inventory FOR AN ENTIRE YEAR.\n\nI was on the verge of slipping into depression. I had so much hope going into this, but I was failing to get any sort of traction at scale.\n\nWorst of all, it wasn’t my money invested, so I felt even worse, but I had no choice but to wake up everyday and continue to try. I owed it to my dad.\n\nThis is probably where most people would give up. It’s not sexy to wake up and do the same thing every day with 0 results.\n\nLooking back, I realize that this was just one of my many valleys of despair.\nA Glimmer of Hope\n\nOut of slight desperation, I decided to listen to my good friend TJ of Ramp Health on advice he had been giving me for months: promote PreSleep on Twitter/X,\n\nIt proved to be one of the greatest decisions I made for the business.\n\nBowTiedNeuron posted the first PreSleep review on Twitter/X and I revealed that I was the owner behind the brand. After that post, my phone blew up with sales like I had never seen before. My first big break. Almost exactly 1 year from starting the business.\n\nThat night was truly one of the craziest experiences of my life, and it was the most amount of money I had ever made in a single day at the time.\n\nMy girlfriend and I packed orders all night, but it didn’t matter, I was riding high like no other.\n\nThis is when I knew I could make it work. We finally had a winning strategy. Painfully simple yet effective.\n\nBut this doesn’t mean that there are no more problems in the business…\nThe Supplier Fiasco\n\nOnce I had about half of our inventory left, I placed another order with my manufacturer and was so excited because I knew we would sell out of our first round of inventory fast.\n\nThis excitement was short-lived.\n\nThis next batch of inventory tasted completely different from the first. It was a massive punch in the face. I knew I couldn’t ship these units. It would’ve been a disservice to everyone that purchased to give them something I myself wouldn’t use.\n\nThis obviously left a bad taste in my mouth (literally and figuratively). This is when I knew I needed to find a different supplier, and thankfully I did.\n\nThis has ultimately been the main reason why PreSleep has had so many delays due to inefficiencies and empty promises by our supplier.\n\nBut being sold out is “such a good problem to have,” right? No, not at all.\n\nIt’s been extremely stressful, and it could’ve been avoided by finding the right manufacturer in the beginning.\nThe Future of PreSleep\n\nLeaning on affiliates has been the biggest mover so far for PreSleep.\n\nI rinsed and repeated this strategy of finding Twitter accounts who met the following criteria:\n\n    Find an account in the health/fitness niche\n\n    Make sure they have an engaged following\n\n    Verify they have an audience of at least 5k followers\n\n    Send PreSleep for no charge\n\n    If they like it, I would ask for a post\n\n    Offer an affiliate code so they can get a cut for their support\n\nIt’s simple, win and help win. Momentum grew, and similar results occurred.\n\nNow I have my VA do most of this, so I can free up my time to work on other aspects of the business.\n\nI have also outsourced fulfillment after many late nights of fulfilling orders with my girlfriend, mom, and dad. They were very thankful I got a 3PL. They were overworked and underpaid.\n\nOur supply chain is currently in shambles due to having to switch manufacturers, but I promise this will only be temporary.\n\nOverall, the future of PreSleep is bright:\n\nI have a massive announcement that is coming up, and I will be able to talk more about it in the coming months.\n\nLet’s just say I don’t think we will be selling out for too much longer…\nConcluding Takeaways:\n\n    Just start; it’ll never be the perfect time\n\n    Do not stop.\n\n    Test demand for your product before buying inventory\n\n    Once you find a winning strategy for getting customers, triple down on it.\n\nI’m not a genius. To get this far, I showed up every day, didn’t get paid for it, spent thousands of dollars on an unknown outcome, and willed it into existence.\n\nWhen I was doing 0 sales a day for weeks, I would daydream of moments where my Shopify notifications would blow up my phone.\n\nFor those of you out there only doing a couple sales a week, and struggling to get traction, do not quit. It sucks, and it’s painful working every single day and seeing no results, but this is the right of passage.\n\nHaving this mindset is the only way to continue on. Don’t dwell on it. Just keep getting better, one day at a time.\n\nThis attitude has legitimately been why I was able to get PreSleep where it is today and have legitimate exit velocity to work on PreSleep full time (soon).\n\nThat’s my story, I hope someone out there can find some value in this and learn something.\n\nYou can find me on Twitter/X BowTiedVampDeer and if you’re interested in checking out PreSleep you can find it here and if we’re sold out at the time you're reading this, don’t blame me; blame my supplier.\n\nThe goal of this post was to show you the raw work it takes to bring a brand to life. The path isn't easy, but god damn, it's worth it.\n\n-BowtiedVampDeer\nSpecial Thanks to those Supporting PreSleep:\n\n    Again, huge thank you to BowtiedBull for letting me share my story with their audience\n\n    My dad for supporting my business without him PreSleep wouldn’t exist.\n\n    My mom for making a million post office runs for me while I worked my W2\n\n    My girlfriend for being the most supportive person in the world.\n\n    Tommy Salami for being a great friend and mentor throughout this entire process.\n\n    BowtiedQuoll for editing this post and his help with copywriting.\n\n    BowTiedTikTok for showing me how to create viral content.\n\n    BowtiedCommoner for having me on her podcast “Common Sense”.\n\n    BowtiedJester for keeping me focused on content creation.\n\n    BowtiedFawn for always being available to offer her valuable insight.\n\n    BowtiedOpossum for reframing my perspective on supply chain.\n\n    BowtiedCocoon for helping me get a W2 sales job.\n\n    Everyone that has purchased PreSleep and supported my dream.\n",
      "strength": 0.9899999011375039,
      "metadata": {
        "source": "data/7.md",
        "title": "7",
        "type": "document",
        "file_size": 12907
      },
      "created_at": "2025-07-17T21:04:12.051955",
      "last_accessed": "2025-07-17T21:04:12.151791",
      "id": "pattern_1fe3c3b5_1752800747"
    },
    "pattern_98565a0d_1752800652": {
      "content": "Document: 7\nFirst off, I would like to thank BTB for allowing me to use their platform to share my story. If it wasn’t for them and the entire community they built, I would probably be a poverty-stricken gym teac...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/7.md"
      },
      "created_at": "2025-07-17T21:04:12.062338",
      "last_accessed": "2025-07-17T21:04:12.062339",
      "id": "pattern_98565a0d_1752800747"
    },
    "pattern_b30eceec_1752800652": {
      "content": "Hello, anon. I'm BowTiedStealth, founder of Turret Fitness (what used to be Gript, which we'll get into).\n\nStarting this biz has taught me infinite things that would have been impossible to learn had I not done it myself (and I have an MBA…lol). My hope is that this post shows you some of the pitfalls that await any who dare to start a business.\n\nFor starters though, a huge thank you to BowTiedBull for the opportunity to write this post. Their Substack has been absolutely invaluable while starting and building Turret Fitness.\nIdeation\n\nI'll be the first to tell you that my vacuum insulated stainless steel protein shakers are not groundbreaking.\n\nI'm not Steve Jobs over here introducing the first phone with no buttons.\n\nWhen I started Gript, I was simply trying to solve my own problem of protein sitting in a plastic shaker for multiple hours while I drive to the gym, lift, shower, drive to the office, and then drink it. A quick google search didn't show me anything that I actually wanted to buy, so I decided to make my own.\n\nThat was about it.\n\nIdeas are a dime a dozen, so just pick one that you don't mind thinking about all day every day, and move out on it.\nName\n\nIt's popular around these parts to say that the name of your biz doesn't matter that much, and I tend to agree.\n\nHowever, it is important that you pick something that people will remember, generally fits the idea/vibe you have for the biz, and most importantly...IS NOT ALREADY TRADEMARKED.\n\nWhen I was signing up for Amazon Brand Registry, I learned you need at least a pending trademark to get registered.\n\nOkay, time to go get a trademark for the name GRIPT.\n\nI HIGHLY recommend using a law firm to submit your trademark application on your behalf, for three reasons.\n\n    You need a law firm to sign off on it, even if you do it yourself\n\n    Your time is better spent doing things other than learning the process for properly submitting a trademark application\n\n    It’s good to have a relationship with an IP law firm should you need one later, whether to play offense or defense\n\nTurns out there are enough other trademarks similar enough to “GRIPT” that the law firm assessed my probability of success as “low”.\n\nTime to rebrand.\n\nThat’s why and how I went from GRIPT to Turret Fitness. Nothing else about the business changed when I did that.\nLegal Stuff\n\nWhile we’re on the topic of legal stuff, allow me to introduce you to the idea of an \"IP Portfolio\". I am far from an expert on this, and I'm not a lawyer or attorney or anything related, so consult one if you need one.\n\nYour IP Portfolio is the collection of patents and trademarks that make your business unique.\n\nYou need to be building your IP portfolio as you build your business. However, it's important to balance how much of this you do. Every patent and trademark application costs money, so it's up to you to find the right balance between what does and does not need to be protected, at least initially. Do not blow your entire launch budget on IP protection and then have no money left to buy your inventory, start running ads, etc.\n\nIf you want to sell on Amazon (you should want to sell on Amazon), you will need at least a pending trademark for your business name to do so. I did not know this.\n\nIf you do have some revolutionary product, you will want to patent it, be it a design or utility patent. I'm not qualified to go into details on this, so DYOR.\n\nAny potential legal challenges you face can cost you tons of time and money that is much better spent on other things.\n\nDo not take this stuff lightly. It adds up quickly.\nLogo\n\nThis is one thing that I will say you should spend almost zero time on. For the Gript logo, I opened Canva, typed \"Gript\", found a font I liked, and downloaded it. That was it.\n\nFor the Turret Fitness logo, I paid somebody on Upwork and she did it for me. You have much better things to be spending your brain cells on than a logo.\nManufacturing\n\nUnless you're a masochist or have extremely deep pockets, you will need somebody to manufacture your product for you. Luckily we live in the year 2025 and finding manufacturers has never been easier. Alibaba is a good place to start.\n\nYou can search by the type of product you want (in my case, vacuum insulated drinking containers), and it will give you a list of businesses that make that sort of product. Then you just cruise through the options, look for traits that you like (customization, MOQs, years in business, country of origin, etc), and start sending messages. Most of these people, in my experience, are extremely easy to work with and very responsive.\n\nI’m an American, and I love America. I desperately wanted to make my shakers here in America. I was able to find exactly ONE company that manufactures stainless steel insulated drinkware and their MOQ was 250,000 units.\n\nI would’ve been bankrupt before even starting.\n\nThe manufacturer I ended up going with has an MOQ of 100. Much more palatable for somebody just starting out.\n\nAll this to say, don’t be afraid to manufacture overseas. You don’t have to like it, but chances are you aren’t one of the people that shipped American manufacturing overseas. You’re just operating in the environment that was created for you.\n\nIf any of your customers (actual or prospective) have a problem with it, block them and move on. They’re not the type of person you want as a customer anyway.\n\nThe first manufacturer I contacted was initially helpful, sent me a 3D printed prototype of what I’d described, and then when I went back to him with edits, he ghosted me. Jerk.\n\nMove on quick.\n\nThe next manufacturer I tried is easy to work with, did LOTS of back and forth to get the design right, and has been very responsive.\nPrototypes\n\nThe first thing I did with my new manufacturer was order a sample of one of their already existed products to make sure the quality was there. This began the process of designing the shaker, the mixing spring, the packaging, all of it.\n\nOne thing I will strongly recommend is to \"dry run\" as much of this stuff as possible prior to placing your initial order of inventory.\n\nIn my case, my manufacturer produced multiple 3D printed prototypes for me that got progressively closer to “real”:\n\n    Plain 3D printed single-walled\n\n    Plain 3D printed double walled with proper packaging\n\n    Painted 3D printed with the logo on it in the proper packaging\n\nAt this point I felt comfortable enough to pay the mold opening fee.\n\nOnce the mold was open, I ordered more samples, this time one in each color in a branded box and only placed my initial inventory order once those samples were received and met my expectations.\n\nThat's how I minimized my manufacturing risk.\nDemand Test\n\nThis idea is far from ground breaking, and I'm not the first one to talk about it, and this is not the first time _I_ have talked about it. (source)\n\nYou need to test demand before you buy inventory. This is what you can be doing while you're getting your manufacturing spun up.\n\nGet your site built (Shopify is the obvious choice if you're doing ecomm) using Youtube tutorials, reddit forums, Shopify forums, and finding people online (either in the jungle, Upwork, Fiverr, etc) that can make your product images for you. Use other ecom sites (jungle or otherwise) for ideas on how your site can look. I practically lived on TJBuongiorno’s Ramp Health site while building mine, and surely bugged the shit out of him with a million stupid questions. BowTiedVDeer has a great post on his old (hacked) account about how he created content before he had product. (source)\n\nOnce you have your site built, you can start running ads. Use Meta Ads Library to scope out what your competition is doing. The style, the creatives, the text, etc. You can even do what I did and copy and paste the text from their ads, change the branding to yours, slight edits to change the vibe, and run it.\n\n$40/day is a good place to start.\n\nDo you then get sales?\n\nWhen I was demand testing, I didn't worry about ROAS, CPC, or anything like that. I figured I could worry about all of that later. Right now, you're simply trying to answer the question...do people want to buy this?\n\nIf the answer is yes (you're getting sales), then keep chugging on the manufacturing piece.\nOther Considerations\n\nCustomer Acquisition Cost\n\nI didn’t think about this until I was signing up my first few affiliates and I thought to myself\n\n“damn, I gotta pay the affiliate 10%, AND give a 10% discount?? That’s 20%!!!”\n\nOh to be naïve again.\n\nThen the gears started turning…\n\n“Build it and they will come” does not work in ecom\n\nYou have to pay to get a purchase…be it via affiliate discounts/commission, free product, ad spend, UGC purchases, whatever.\n\nYour margins are what determines how much you can pay for each purchase and still be profitable.\n\nAnd your margins are determined by your sale price minus your expenses.\nExpenses\n\nTwo types: Fixed and variable\n\nFixed expenses you pay no matter what. In ecomm this is stuff like your Shopify subscription, Klaviyo subscription, any other paid apps you have on your site.\n\nVariable expenses you pay more when you sell more. This is stuff like your COGS, shipping, packaging, fulfillment (there might also be fixed cost with fulfillment), etc.\n\nIt is CRUCIAL that you know these numbers so you don’t get to the end of a month and not be able to pay off your biz credit card because you were running too high of a CAC.\nLTV\n\nYour customers long term value.\n\nOkay great, you paid to acquire a customer, congratulations. They know about your brand and have a hopefully good experience with it. Now, how long do they stick around? Are they purchasing from you every single month for the next 20 years? Are they going to buy once and then be set for life?\n\nThis was something else I didn’t consider when I was starting. People only need a few shakers before they’re all set for a longggg time (especially when the shaker is as good as mine is).\n\nThis is why you see so many brands building around recurring products. Gum, supplements, toothpaste, soap, etc. All things that the customer will burn through and need to reorder, ideally from you.\n\nYou can tolerate a high CAC if your LTV is strong enough to support it.\nSacrifices\n\nBuilding a business takes time, there’s no denying that. You need to find somewhere to pull time from if you want to start something. BowTiedOpossum talks about this a lot, how you have a lot more time than you think you do every day/week/month, you’re just wasting it on\n\nstupid stuff.\n\nIf you’re a young single guy, you’ll find no sympathy from me.\n\nI have a full-time in-office W-2, a wife, and multiple very young children. I have to go to work to put food on the table and a roof over our heads, I have to spend time with and raise my children, I have to spend time with my wife to maintain a healthy marriage, I have to work out for my physical and mental health.\n\nNone of those things can change because of my business.The thing that I sacrifice instead is sleep.\n\nI work on the business when everybody else in my family is asleep. And yes, I do move slower than other people because of that. Very limited time to work on it.\n\nI’ll tell you the same thing I tell people IRL that are putting off getting married or having kids for “the right time”. The right time doesn’t exist. You make the right time.\n\nOr you wait for the right time and then never do it because the right time never comes along.\n\nUp to you.\nConclusion\n\nAlright I think that’s about it. I’m sure I’m leaving a lot out, but the big takeaway here is to just start. It’s impossible to know everything before you get started. Everything is an unknown unknown initially and the only way to find out is to start, solve one problem at a time (whichever alligator is closest to your boat, as they say), and learn as you grow.\n\nIn the meantime, you can get the best protein shaker of your life at turretfitness.com.\n\nVacuum insulated for you people that wait too long to drink your stuff and still want it cold (like me).\n\nStainless steel for you people that hate that disgusting protein shaker stench (like me).\n\nErgonomic design for you people that are sick of these stainless-steel drinking vessels being impossible to hold onto (like me).\n\nIntegrated measurement dial on the inside of the bottle for you people that track your macros (like me…sort of).\n\nDual silicone seals in the lid for you people that don’t want to leak stuff all over your gym bag (like me).\n\nDishwasher safe for you people that hate washing stuff by hand (like me).\n\nI personally have 4 in my rotation (two blacks, a white, and a raw).\n\nI use three on days I lift: one for my pre workout, one for my water while lifting, and one for my protein afterwards. All three are prepped the night before, sit on the counter overnight, and are still cold when I get to them the next morning.\n\nThe fourth is for my non-lifting cardio days when I wait until 2pm-ish to drink my still cold protein that I made the night before.\n\nTurretfitness.com\n",
      "strength": 0.9899999011375039,
      "metadata": {
        "source": "data/8.md",
        "title": "8",
        "type": "document",
        "file_size": 13023
      },
      "created_at": "2025-07-17T21:04:12.066759",
      "last_accessed": "2025-07-17T21:04:12.101475",
      "id": "pattern_b30eceec_1752800747"
    },
    "pattern_1cf49e9d_1752800652": {
      "content": "Document: 8\nHello, anon. I'm BowTiedStealth, founder of Turret Fitness (what used to be Gript, which we'll get into).\n\nStarting this biz has taught me infinite things that would have been impossible to learn had ...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/8.md"
      },
      "created_at": "2025-07-17T21:04:12.080513",
      "last_accessed": "2025-07-17T21:04:12.080513",
      "id": "pattern_1cf49e9d_1752800747"
    },
    "pattern_c4fd3e10_1752800652": {
      "content": "Document: 6\nWelcome Avatar! First and foremost, I want to thank BTB for the opportunity and everything they’ve done directly and indirectly for me over the last year - what you’re about to read wouldn’t have been...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/6.md"
      },
      "created_at": "2025-07-17T21:04:12.101487",
      "last_accessed": "2025-07-17T21:04:12.101488",
      "id": "pattern_c4fd3e10_1752800747"
    },
    "pattern_50f38fed_1752800652": {
      "content": "The More Things Change, The More Things Stay the Same\n\nMy grandpa used to say to us all the time, “hay los que lo dicen, y hay los que lo hacen”, those that say, and those that do. But he’d also use it to remind us that what people say is usually not what people do.\n\nIf you’ve been following in the jungle with even a casual eye, you know selling to women is the most lucrative place to be as women account for a majority of household purchases (Source), so let’s niche down and see what Gen Z women are doing.\n\nI’m not Really Old yet, so I will try to keep my “get off my lawn” in check, but no promises.\n\nSurprise, money dysmorphia continues (Source): even when only just under a third of Gen Z women say they are doing well/very well financially (Source), self-care spending continues to climb (Source), with 52% of Gen Zers surveyed regretted overspending on beauty products specifically (Source).\n\nSource (Source)\n\nSafe to say, saving and spending are not considered binary choices for the Gen Z ladies, but more dynamic depending on credit available (Source).\n\nSpending Realities: Beauty & Skincare as Non-Negotiable & the Dupe Phenomenon\n\nThis is good news for you, anon.\n\nGen Z women allocate over 2,000 USTT annually for beauty purchases (2,048 USTT per this Source), 52% of Gen Z use beauty for self-expression (Source), 92% say their routines are influenced by creators (Source) and 83% of Gen Z women shop for creator-recommended beauty products online (Source).\n\nAnd no, “dupe” here does not refer to the Wirkin (Source), or the “Fadas” et al Nigerian vendors hustle on Broadway in Manhattan, or the binders of “Louie Louie Louie!” slung at everyone walking down a certain section of Canal Street nearby.\n\nI’m not even mentioning Chinese manufacturers addressing Westerners directly recently. The idea of replicas or “reps” being made in the same factories to the 90% completion mark, only to then by shipped to France or Italy for finishing and a shiny “Made in France” or “Made in Italy” tag is not new (Source), it’s just that these facilities are saying it themselves now, publicly, one TikTok at a time (Source).\n\nSugar babies realizing they were renting out their bodies for $30 Birkin Bags from China.\n\nNope, don’t care one bit.\n\nThe dupes we care about are make-up and fragrance. We see this in beauty every downturn, a DIY aspect to self-care, which Gen Z has taken up this time and run with (Source).\n\nBTB hit on this already with their mention of press-on nails, but think re-usable lashes, lash glue, lip tape instead of paying for filler, lip plumpers, etc.\n\nBut we’re taking it a step further here.\nThe Canal Street Experience Has Gone Digital\n\nInstead of a worn binder full of sticky pages filled with blurry photos of Supreme knock offs to flip through, then a random squeeze behind fake walls in a sour smelling, too packed store, and narrow, dark staircases you have to trip through to get to a back room, you can skip the New York experience entirely.\n\nA side-by-side comparison by your favorite aspirational micro-influencer of their latest dupe haul, often a direct response to your suggestions, for an unboxing or a GRWM, step-by-step, in the palm of your hand, is now available on demand, 24/7. No hecklers, no rats in dark hallways, or bags smelling like brand new gas station ponchos. Just a girl, her curiosity, and her intense need for acceptance, clinging on every word of a 90 second unboxing, from a voice she listens to daily as part of her digital routine.\n\nIn a world where even the wealthy are embracing dupes (Source), there is a thriving fashion and beauty ecosystem of It-Girl Finds, some even offering their followers access to their evolving Google Docs of notes, links and comparisons (Source) for a nominal monthly fee. These influencers don’t need millions of followers, sometimes only a few affiliate deals and high engagement with a core audience of a few thousand is enough to get up to a solid five figures every month, obviously more if part of a viral drop, or if producing YouTube content, on TikTok’s Creator Platform, or on Substack.\n\nFor Gen Z women, it’s not about deception, but practicality. Like buying cz sets of jewelry you paid way too much for in the past when it comes to travel, so you can leave that headache at home. “Cost per wear” or “cost per use” are both forms of “girl math” attempting to justify luxury price tags in the past.\n\nNow, Gen Z is saying “we don’t accept your gate keeping, your lifestyle is actually accessible now” whether true or imagined. No need for girl math here, we will get the look or experience and not have to skimp on anything else to compensate. Source\n\nThe Gen Z search for authenticity has shifted to a need for rational transparency. “I may not have the money for the original of this, but I can at least signal to my friends that I know this is aspirational and at least appear to achieve the look/smell/experience”.\n\nWhen so much of a Gen Zer’s life is documented digitally, either by herself or by others, the community of beauty rituals especially has become even more tribal. The pressure to look “on” is near constant.\n\nSee also, their younger siblings, than the tween obsession with the Drunk Elephant line (LINK).\nCase Studies\n\nThat’s great mouse, but give me an example, I’m sweating over here!\n\nFor makeup, take a look at what both e.l.f. and Charlotte Tilbury have done with micro-influencers as affiliates (Source). Success leaves clues.\n\nFor fragrance, read up on Dossier (or ask Perplexity to read, summarize and expand on it, for you, Source and Source).\n\nIf you have an H&M or Zara near you, go in person and take a look at their stores. Not only does their inventory turnover very often on apparel, but they also have their own white label scents, for both adults and kids, which can shift with the seasons, and whatever IP they are licensing for that season for kids clothes (Disney, Mattel, et al).\n\nSource\nClosing Thoughts\n\nStream of consciousness dump of what goes through my head at 2:19AM ET of a night working session, in no particular order. YMMV, take with a grain of salt:\n\n    If you operate a brand, hope you have heeded BTB’s advice to get those SKUs in and stocked. You want to be able to turn the screws to your advantage. One of those long form set ups where one or two reps can create muscle memory for life. Do it once or twice, can’t unlearn it.\n\n    If you need a product ideas, use AI. I’m not saying selling beta-carotene drops is really the best angle for beauty targeted to Gen Z here, but think along those lines, anything where you can build a repeat customer base, in a beauty niche. Reddit is a goldmine too, Gen Z loves to post their skincare/beauty routines and get feedback, IYKYK. Regardless, a beauty brand is a muscle that will serve you well in any cycle.\n\n    Personally I’m down about 13% YoY ish, I try not to look at it in a vacuum. Cycles to everything, It sucks until it doesn’t and then you don’t care. Panic/glee replaced with even keeled detachment.\n\n    Keep going. Human behavior will not change. People will always look to signal status, no matter what they tell their family, friends, themselves or a survey on their AmEx app.\n\n    As I’ve mentioned in this space before, AI tools and my crappy “coding” have helped me immensely over the past ten months. I can thank AI for that, hammering away to teach myself what I needed when I needed it. Don’t overlook what is available to you. 5 minutes here and ten minutes there add up. But AI in its current form is very much a tool, not a substitute for doing the work. Don’t let 10,000 tokens of model make you feel like you checked the box for the day. Just like watching someone lift a superset is not that same as putting up the plates yourself.\n\n    It is impossible to lose 100% of the time. You only need one real win to create your own gravity.\n\nBut then again, what do I know? I’m just a cartoon mouse who can’t even find a tent these days.\n\nBack to the sewer.\nIn Conclusion\n\nGrateful once again to BTB for giving me the space to write here. Hope you found this helpful, you can find me sometimes posting/RT-ing on X FKA Twitter @The_CryptoMouse\n\nAs always, shoot me a DM if you find yourself stuck, always happy to help out the jungle. Will do my best to catch up as quickly as I can on DMs, and make sure you are on my mailing list.\n",
      "strength": 0.7199999281000028,
      "metadata": {
        "source": "data/1.md",
        "title": "1",
        "type": "document",
        "file_size": 8366
      },
      "created_at": "2025-07-17T21:04:12.107031",
      "last_accessed": "2025-07-17T21:04:12.107032",
      "id": "pattern_50f38fed_1752800747"
    },
    "pattern_29d12be9_1752800652": {
      "content": "Document: 1\nThe More Things Change, The More Things Stay the Same\n\nMy grandpa used to say to us all the time, “hay los que lo dicen, y hay los que lo hacen”, those that say, and those that do. But he’d also use i...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/1.md"
      },
      "created_at": "2025-07-17T21:04:12.120692",
      "last_accessed": "2025-07-17T21:04:12.120693",
      "id": "pattern_29d12be9_1752800747"
    },
    "pattern_ff198fde_1752800652": {
      "content": "Document: 9\nAs usual, we like to highlight new sustainable businesses launched in the jungle. Sometimes we see them immediately sometimes it takes a few months or even a year. Doesn’t matter.\n\nThe part that does ...",
      "strength": 0.6399999360888915,
      "metadata": {
        "type": "title",
        "source": "data/9.md"
      },
      "created_at": "2025-07-17T21:04:12.151802",
      "last_accessed": "2025-07-17T21:04:12.151802",
      "id": "pattern_ff198fde_1752800747"
    },
    "pattern_b5d55352_1752800681": {
      "content": "User query: what are characteristics of successful ecommerce products?",
      "strength": 0.5599999569422234,
      "metadata": {
        "type": "query",
        "turn": 1,
        "timestamp": "2025-07-17T21:04:41.402549"
      },
      "created_at": "2025-07-17T21:04:41.402592",
      "last_accessed": "2025-07-17T21:04:41.402594",
      "id": "pattern_b5d55352_1752800747"
    },
    "pattern_99f9de0a_1752800681": {
      "content": "Assistant response: Based on the information I have, here are the key points:\n\n1. User query: what are characteristics of successful ecommerce products?\n\n2. User query: what are characteristics of successful ecommerce products?\n\n",
      "strength": 0.47999996309333426,
      "metadata": {
        "type": "response",
        "turn": 1,
        "query_id": "pattern_b5d55352_1752800681",
        "timestamp": "2025-07-17T21:04:41.447937"
      },
      "created_at": "2025-07-17T21:04:41.447949",
      "last_accessed": "2025-07-17T21:04:41.447950",
      "id": "pattern_99f9de0a_1752800747"
    },
    "pattern_d641529e_1752800722": {
      "content": "User query: Gen Z women and beauty spending",
      "strength": 0.7699999646431949,
      "metadata": {
        "type": "query",
        "turn": 1,
        "timestamp": "2025-07-17T21:05:22.553727"
      },
      "created_at": "2025-07-17T21:05:22.553738",
      "last_accessed": "2025-07-17T21:05:44.814021",
      "id": "pattern_d641529e_1752800747"
    },
    "pattern_93ffaed6_1752800722": {
      "content": "Assistant response: Based on the information I have, here are the key points:\n\n1. User query: Gen Z women and beauty spending\n\n2. User query: Gen Z women and beauty spending\n\n3. The More Things Change, The More Things Stay the Same\n\nMy grandpa used to say to us all the time, “hay los que lo dicen, y hay los que lo hacen”, those that say, and those that do. But he’d also use it to remind us that what people say is usually not what people do.\n\nIf you’ve been following in the jungle with even a casual eye, you know selling to women is the most lucrative place to be as women account for a majority of household purchases (Source), so let’s niche down and see what Gen Z women...\n\n4. How Gen Z's Favorite Beauty Brands Leverage Influencer Marketing to Drive Sustainable Growth\nLet’s unpack the ingenious strategies behind Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury.\n\nAs we can see from recent trends like ‘de-influencing’, digitally native shoppers like Gen Zers demand honesty and genuine opinions now more than ever before. In fact, 92% of Gen Zers say authenticity is the most important value for them. Following suit, the world’s savviest brands are placing authenticity as...\n\n5. The L in GTL\n\nHere is another idea to get you thinking about selling to women with a repeat consumable product. Not quite the same as press-on nails, but similar – laundry detergent, specifically the concept of elevating every day routines to luxury experiences. Are the margins super amazing? Maybe not lights out, think gross of 50-70% with a net in the 25% plus range, depending on how you set up your pipeline (heavy emphasis on robotics here, more on that later). And.\n\nThe nexus here is a repea...\n\n",
      "strength": 0.6599999696941671,
      "metadata": {
        "type": "response",
        "turn": 1,
        "query_id": "pattern_d641529e_1752800722",
        "timestamp": "2025-07-17T21:05:22.569927"
      },
      "created_at": "2025-07-17T21:05:22.569937",
      "last_accessed": "2025-07-17T21:05:44.888571",
      "id": "pattern_93ffaed6_1752800747"
    }
  },
  "attractors": {
    "pattern_b4401a37_1752800652": {
      "pattern": {
        "content": "You are a helpful assistant that provides accurate and thoughtful information.\nYou communicate clearly and precisely, always considering the context of the conversation.\n",
        "strength": 0.8999999820250002,
        "metadata": {},
        "created_at": "2025-07-17T21:04:12.027976",
        "last_accessed": "2025-07-17T21:04:12.027980",
        "id": "pattern_b4401a37_1752800747"
      },
      "basin_width": 0.8,
      "formation_time": "2025-07-17T21:05:47.779488",
      "influence_count": 0
    },
    "pattern_e15b7c43_1752800652": {
      "pattern": {
        "content": "When answering questions, break down complex topics into understandable components.\nUse examples where appropriate to illustrate concepts.\n",
        "strength": 0.7999999840222224,
        "metadata": {},
        "created_at": "2025-07-17T21:04:12.028029",
        "last_accessed": "2025-07-17T21:04:12.028029",
        "id": "pattern_e15b7c43_1752800747"
      },
      "basin_width": 0.7,
      "formation_time": "2025-07-17T21:05:47.779494",
      "influence_count": 0
    },
    "pattern_ff8dfccb_1752800652": {
      "pattern": {
        "content": "## Summary of the Business Insider Dossier Perfume & Cologne Review\n\n**Dossier** is a New York-based brand, founded in 2018, that specializes in creating affordable, high-quality fragrances inspired by popular luxury perfumes and colognes. The brand’s mission is to democratize access to high-end scents by offering vegan, cruelty-free, and sustainably produced alternatives, starting at just $19. These fragrances are modeled after bestsellers from brands like YSL, Le Labo, Chanel, Gucci, Tom Ford, and Maison Margiela, among others[2][1].\n\n### Key Findings from the Review\n\n- **Quality & Authenticity:** Three Insider Reviews team members tested a range of Dossier fragrances and unanimously agreed that the quality and scent accuracy were impressive. Even people familiar with the original luxury fragrances often couldn’t tell the difference between Dossier’s versions and the originals[2][1].\n- **Affordability:** Dossier’s fragrances are significantly less expensive than their luxury counterparts. For example, a 1.7-ounce bottle of Dossier’s Aromatic Star Anise (inspired by Dior Sauvage) costs $29, compared to $100 for a 2-ounce bottle of Dior Sauvage[2][1].\n- **Packaging:** Dossier uses minimalist, generic packaging made from 100% recycled glass and cardboard. This helps keep costs low but means you won’t get the ornate bottles typical of luxury brands[2][1].\n- **Longevity:** While most Dossier fragrances perform well, some (like Ambery Vanilla, inspired by YSL Black Opium) may not last all day. Application tips, such as layering with lotion, can help extend longevity[2][1].\n- **Risk-Free Shopping:** Dossier offers a generous return policy, allowing customers to return full-size bottles for a full refund if they aren’t satisfied[2][1].\n- **Scent Variety:** The brand offers a wide range of scents for both men and women, including dupes for cult favorites like Le Labo’s Santal 33 and By Kilian’s Love, Don’t Be Shy[2][1].\n\n### Detailed Comparisons\n\n| Original Luxury Scent        | Dossier Dupe        | Notes from Reviewers                                                                            |\n| ---------------------------- | ------------------- | ----------------------------------------------------------------------------------------------- |\n| Dior Sauvage                 | Aromatic Star Anise | Smelled identical; much more affordable; reviewer switched to Dossier permanently               |\n| YSL Black Opium              | Ambery Vanilla      | Very similar; Dossier’s version is less subtle and doesn’t last as long                         |\n| YSL Libre                    | Floral Lavender     | Indistinguishable in blind tests; reviewers and their partners couldn’t tell the difference     |\n| By Kilian Love, Don’t Be Shy | Floral Marshmallow  | Warm, inviting; reviewer would repurchase even without direct comparison to the luxury original |\n| Le Labo Santal 33            | Woody Sandalwood    | Warm, long-lasting; highly regarded even without side-by-side comparison                        |\n\n### How Dossier Keeps Prices Low\n\n- **Direct-to-Consumer Model:** Eliminates traditional retail markups.\n- **Generic Packaging:** Uses uniform, minimalist bottles and boxes.\n- **No Brand Name Premium:** You pay for the scent and ingredients, not the logo.\n- **Bulk Discounts:** Additional savings for buying multiple bottles[2][1].\n\n### Pros and Cons\n\n**Pros:**\n\n- Affordable alternatives to expensive designer fragrances\n- Vegan, cruelty-free, and sustainably produced\n- Scents are highly accurate to originals\n- Risk-free returns and bulk discounts\n\n**Cons:**\n\n- Generic packaging may not appeal to collectors\n- Some fragrances may not last as long as luxury originals[2][1]\n\n## Expanded Insights\n\n**Performance and Wear:**  \nWhile most Dossier scents receive praise for their longevity, some reviewers note that certain formulas (especially those inspired by lighter or gourmand fragrances) may require midday reapplication. This is typical for Eau de Toilette formulations, but Dossier also offers Eau de Parfum options, which generally last longer[6][9].\n\n**Sustainability and Ethics:**  \nDossier emphasizes clean ingredients and eco-friendly packaging. All products are vegan and cruelty-free, and the brand avoids parabens, phthalates, colorants, and UV filters[9].\n\n**Shopping Experience:**  \nThe buying process is transparent, with each Dossier fragrance clearly labeled with its luxury inspiration. The brand also offers a quiz to help customers find their ideal scent and provides educational content to make fragrance shopping more accessible[9].\n\n**Customer Experience:**  \nMost reviews, both editorial and user-generated, are positive, highlighting the value, scent accuracy, and ethical production. Occasional criticisms focus on longevity and the lack of decorative packaging, but these are generally outweighed by the cost savings and scent quality[2][6][9].\n\n## Conclusion\n\nDossier offers a compelling alternative for fragrance lovers who want the experience of luxury scents without the high price tag. The brand’s fragrances are impressively close to their designer inspirations, ethically produced, and accessible to a wider audience. The main trade-offs are simpler packaging and, for some scents, slightly shorter longevity. For most users, these are minor drawbacks compared to the significant savings and quality offered[2][6][9][1].\n",
        "strength": 0.7199999856200003,
        "metadata": {
          "source": "data/5.md",
          "title": "5",
          "type": "document",
          "file_size": 5405
        },
        "created_at": "2025-07-17T21:04:12.028434",
        "last_accessed": "2025-07-17T21:04:12.028435",
        "id": "pattern_ff8dfccb_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779511",
      "influence_count": 0
    },
    "pattern_0c21d287_1752800652": {
      "pattern": {
        "content": "Document: 5\n## Summary of the Business Insider Dossier Perfume & Cologne Review\n\n**Dossier** is a New York-based brand, founded in 2018, that specializes in creating affordable, high-quality fragrances inspired b...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/5.md"
        },
        "created_at": "2025-07-17T21:04:12.028476",
        "last_accessed": "2025-07-17T21:04:12.028477",
        "id": "pattern_0c21d287_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779515",
      "influence_count": 0
    },
    "pattern_d4403543_1752800652": {
      "pattern": {
        "content": "How Gen Z's Favorite Beauty Brands Leverage Influencer Marketing to Drive Sustainable Growth\nLet’s unpack the ingenious strategies behind Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury.\n\nAs we can see from recent trends like ‘de-influencing’, digitally native shoppers like Gen Zers demand honesty and genuine opinions now more than ever before. In fact, 92% of Gen Zers say authenticity is the most important value for them. Following suit, the world’s savviest brands are placing authenticity as a core value in their influencer marketing campaigns.\n\nToday, we’re unpacking how Gen Z’s favorite beauty brands — Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury — are leaning into authentic influencer partnerships to create campaigns that truly resonate with younger consumers.\nRare Beauty\n\nAlthough it was founded by Selena Gomez, Rare Beauty is unlike other celebrity brands. Consumers aren’t buying from Rare Beauty just because they’re big fans of Selena Gomez. Instead, they’re invested in what the mission-driven brand stands for: breaking traditional norms, destigmatizing mental illness, and fostering conversations around hope and agency. These ideas are integrated into every element of Rare Beauty — even its influencer marketing strategies.\n\nUnlike the extravagant influencer trips and parties of other beauty brands, Rare Beauty brings its influencer relationships down to earth by inviting intimate groups of influencers to various wellness retreats where they’re under no obligation to produce content. Rather, they spend the weekend lounging in their comfiest clothes and attending wellness experiences and fireside chats with mental health experts.\n\nFrom a marketer’s perspective, this may seem counterintuitive: if you’re not guaranteed to get content back from influencers, what is the return on investment? But these kinds of community building initiatives are what make a world of a difference when it comes to building a loyal customer base — one that spreads organic word-of-mouth advocacy to their friends (and followers). In fact, Rare Beauty’s unique influencer strategies have allowed it to far outrank other beauty brands in terms of volume of influencer coverage, growing at 110% year-over-year with influencers.\n\nAdditionally, Rare Beauty truly embraces the idea that everyone is an influencer. In May, the brand hosted its first mental health summit, inviting 150 community members — from health and wellness creators like Whitney Simmons to the brand’s most devoted customers — to gather in person, while 50,000 others joined virtually on TikTok from around the world. Again, while attendees weren’t obligated to create content, many still highlighted the event on their own social media accounts, further boosting brand awareness and affinity.\n\nBy investing in its brand community, Rare Beauty has been able to grow at an astronomical rate. A recent survey showed that Rare Beauty ranks second on its list of the top cosmetics brands among Gen Z, and by the end of 2023, Rare Beauty is expected to exceed $300 million in sales — which is triple what it earned in 2022, when sales doubled from 2021.\ne.l.f. Beauty\n\nIn August, e.l.f. Beauty reported its 18th consecutive quarter of sales growth, crediting its social-savvy marketing team for the company’s continued success. On its most recent earnings call, e.l.f. Beauty CEO Tarang Amin talked about the brand’s “disruptive marketing engine,” citing its ability to “generate buzz-worthy moments for our community and reach new audiences with our collaborations.”\n\ne.l.f. Beauty knows how to create viral moments, not only by running unique co-branded promotions with other brands, such as its iconic collaboration with Chipotle, but also by working with a diverse group of creators to varying capacities.\n\nThe brand regularly activates micro-influencers to promote its products on TikTok, then turns their content into ads. But to take its influencer partnerships to the next level, e.l.f. Beauty co-creates entire product lines with popular macro-influencers in the beauty space.\n\nFor example, the brand worked with mega beauty influencer Mikayla Nogueira (15 million followers on TikTok) to create a limited-edition lip liner and lipstick duo in celebration of Mikayla’s wedding. On launch day, the wedding lip kit sold out on the brand’s DTC site within 18 minutes, marking its fastest-ever collection sellout. The collection also helped with brand awareness, as 75% of buyers were first-time customers.\n\nBut it doesn’t stop at TikTok collaborations. Earlier this year, e.l.f. Beauty aired its first Super Bowl ad featuring beloved actress Jennifer Coolidge, who is most recently renowned for her role as Tanya in the hit HBO series, The White Lotus.\n\n‍\n\n‍\n\nThe brand further leveraged their new relationship with Jennifer Coolidge after the Super Bowl, having her star in the brand’s get-ready-with-me YouTube series, “Vanity Table Talks.” e.l.f. Beauty CFO Mandy Fields explained, “[Jennifer Coolidge] is very relevant right now. That’s what we strive to do with our marketing spend. We strive to be culturally relevant and authentically engage with our community.”\n\nStaying on top of trends and being part of cultural zeitgeists has allowed e.l.f. Beauty to seamlessly build a multi-channel influencer marketing program that engages audiences in ways that truly resonate. By doing so, e.l.f. Beauty has been able to experience a minimum of 20% growth in each of the last 18 quarters, with no signs of slowing down.\nCharlotte Tilbury\n\nIt’s no longer just millennials who love Charlotte Tilbury — a growing number of Gen Zers are embracing the brand’s famed products. In fact, according to a recent beauty trends report, Charlotte Tilbury was the most popular beauty brand last year, raking in an astounding 450,000 average monthly searches and a whopping 1.3 billion TikTok views globally.\n\nLike many other millennial-friendly beauty brands that were founded in the early days of social media, Charlotte Tilbury has been ramping up its efforts to adapt to newer platforms and younger audiences. Charlotte Tilbury, the brand’s founder, explained, “I’ve always believed it is essential for us to have an active presence across all channels; each has its own specialities and attracts its own unique audiences that we want to engage with.”\n\nIt’s no wonder the brand takes a full-funnel approach to influencer marketing, running a variety of activations at the same time. Here are just some of Charlotte Tilbury’s ingenious strategies:\n\n    Traditional influencer program: With a focus on video content, Charlotte Tilbury’s influencer partners produce makeup tutorials and get-ready-with-me style videos for Instagram, Facebook, and TikTok. This type of content is high-performing and extremely effective, because audiences can watch as creators apply the makeup and see which product sets to purchase to achieve each look. The brand then takes these influencer-generated videos and repurposes them as paid ads across various social channels.\n\n    Affiliate program: The Charlotte Tilbury Affiliate Program allows creators to earn commissions every time someone purchases from Charlotte Tilbury’s website using the creator’s unique affiliate code, which they typically share on their Instagram Stories. The code allows their followers to get a 15% discount, and affiliates themselves can receive discounts of up to 30% on products. Plus, affiliates gain access to VIP products and more. This attractive affiliate model has allowed the brand to build a strong community of affiliates and an effortless revenue-generating machine — all without breaking the bank.\n\n    Product seeding: Charlotte Tilbury often runs product seeding campaigns, sending PR packages and gifts to influencers, which include a selection of their popular products. With Instagram-worthy packaging and exciting new launches, these packages encourage influencers to try the products and share about them with their followers in organic content, such as unboxing videos, tutorials, and reviews.\n\n    Celebrity brand ambassadors: For years, Charlotte Tilbury has leveraged celebrity endorsements from the likes of Kate Moss, Blake Lively, Drew Barrymore, and Twiggy — particularly for their Pillow Talk product line. In March of this year, the brand also announced its partnership with Gen Z’s favorite supermodel, Bella Hadid, as the official face of the brand. The Charlotte Tilbury team has been known to nurture these partnerships with the celebrities in their network, regularly sharing exclusive behind-the-scenes content from high-profile, star-studded events.\n\nBy implementing a full-funnel influencer marketing strategy, Charlotte Tilbury effectively guides consumers from initial awareness through to conversion and even post-purchase engagement, maximizing the impact of their influencer program across the entire buyer’s journey.\n",
        "strength": 0.7199999856200003,
        "metadata": {
          "source": "data/2.md",
          "title": "2",
          "type": "document",
          "file_size": 8900
        },
        "created_at": "2025-07-17T21:04:12.029053",
        "last_accessed": "2025-07-17T21:04:12.029054",
        "id": "pattern_d4403543_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779539",
      "influence_count": 0
    },
    "pattern_1e28f45c_1752800652": {
      "pattern": {
        "content": "Document: 2\nHow Gen Z's Favorite Beauty Brands Leverage Influencer Marketing to Drive Sustainable Growth\nLet’s unpack the ingenious strategies behind Rare Beauty, e.l.f. Beauty, and Charlotte Tilbury.\n\nAs we can ...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/2.md"
        },
        "created_at": "2025-07-17T21:04:12.030751",
        "last_accessed": "2025-07-17T21:04:12.030751",
        "id": "pattern_1e28f45c_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779544",
      "influence_count": 0
    },
    "pattern_118d7167_1752800652": {
      "pattern": {
        "content": "Dossier review: These under-$50 designer fragrance dupes will replace your expensive originals\nWritten by Amir Ismael edited by Maiya Pascouche\nWhen you buy through our links, Business Insider may earn an affiliate commission. Learn more\nA side-by-side collage with Dossier perfumes on the left and Dossier colognes on the right.\nThree of the Dossier fragrance dupes we tried next to their luxury counterparts. Sally Kaplan/Amir Ismael/Insider\nUpdated Dec 8, 2023, 5:53 PM ET\nSave Saved\n\nWhile luxury brand perfumes and colognes may be of higher quality than the watered-down body mists of our youth, high-end fragrances are often marked up astronomically. Alongside quality ingredient costs, you also end up paying for the brand name, packaging, and the extravagance associated with it.\n\nThankfully, Dossier is the solution for those who simply cannot afford or want to spend luxury prices on perfume. Founded in 2018, Dossier is a New York-based brand specializing in recreating popular high-end fragrances at an accessible price point. All of Dossier's perfumes are vegan, cruelty-free, and sustainably produced. Starting at just $19, you'll find scents inspired by brands like YSL, Le Labo, Chanel, Gucci, Tom Ford, Maison Margiela, and many more.\nAromatic Star Anise\nDossier Aromatic Star Anise\nCheck price at Walmart\nCheck price at Dossier\nDossier Ambery Vanilla\nDossier Ambery Vanilla\nCheck price at Walmart\nCheck price at Dossier\nDossier Floral Lavender\nDossier Floral Lavender\nCheck price at Walmart\nCheck price at Dossier\nThe verdict on Dossier\n\nThree members of the Insider Reviews team tested a variety of Dossier fragrances, and we unanimously agreed that the overall quality and value were high and the perfumes were spot on to their luxury counterparts. Even our loved ones, who are familiar with the fragrances we wear regularly, couldn't tell the difference. Keep reading to learn more about the specific Dossier perfumes we reviewed.\nDior Sauvage vs. Dossier Aromatic Star Anise\nA bottle of Dior Sauvage cologne and Dossier Aromatic Star Anise cologne side-by-side on a table.\nAmir Ismael/Insider\nAromatic Star Anise\nDossier Aromatic Star Anise\nCheck price at Walmart\nCheck price at Dossier\n\nOne of the most significant benefits of shopping at Dossier is getting your favorite scents for far less than the authentic brand name version. Dior Sauvage Eau de Toilette is one of my favorite fragrances, but at $100 for a 2-ounce bottle, I don't like to use it every day. I tried Dossier Aromatic Star Anise, which is the brand's interpretation of Dior Sauvage, and it smelled identical.\n\nAt $29 for a 1.7-ounce bottle, I'm not as reserved with how often I spray it. I can buy three bottles from Dossier for the price of one from Dior. Once I finish my current bottle of Dior, I will not replace it with another. With Dossier Aromatic Star Anise, I have no reason to. — Amir Ismael, Insider Reviews senior reporter\nYSL Black Opium vs. Dossier Ambery Vanilla\nThree bottles of Dossier perfumes on a white surface.\nKayla Bickham/Insider\n\nDossier Ambery Vanilla\nDossier Ambery Vanilla\nCheck price at Walmart\nCheck price at Dossier\n\nYSL Black Opium (usually $95 an ounce) was my first introduction to perfumes after I grew out of body sprays as a teen. Learning the hard way what it means to put on too much perfume has now permanently engraved its rich vanilla scent into my brain. After years and years of wear, I know Dossier's Ambery Vanilla is its sister scent without even having a bottle of YSL Black Opium of my own anymore. A yummy fall scent is the best way to describe what both bottles smell like. However, there's a difference or two that sets the two scents apart.\n\nThere's something about the warmth of YSL's take on a seductive vanilla that's a bit more subtle than its dupe from Dossier. While the spicy gourmand is at the forefront of both perfumes, the vanilla sneaks up and takes over once settled on the skin in Black Opium, while Ambery Vanilla is more of a mix of the two scents it's named after. Although the licorice and black coffee notes linger a bit long in Ambery Vanilla, the perfume itself doesn't last all day. — Kayla Bickham, Insider Reviews style and beauty fellow\nYSL Libre vs. Dossier Floral Lavender\nA bottle of YSL Libre and Dossier Floral Lavendar perfume on a marble surface.\nSally Kaplan/Insider\n\nDossier Floral Lavender\nDossier Floral Lavender\nCheck price at Walmart\nCheck price at Dossier\n\nI tested Dossier's dupe for YSL Libre perfume, which I wore on my wedding day and use for many special occasions. My wife couldn't tell the difference at all, and I could barely tell myself after 2 years of using YSL! I also tested several other fragrances against their original inspirations and had the same reaction to each of them. I will never order expensive perfume again — I don't know how or why Dossier didn't exist sooner! — Sally Kaplan, Insider Reviews executive editor\n\nImmediately after I began testing Dossier, my girlfriend ordered a few dupes of fragrances in her collection — one of which also being YSL Libre. I did a blind side-by-side smell test, and I, too, can confirm that YSL Libre and Dossier's Floral Lavender smell exactly the same. — Amir Ismael, Insider Reviews senior reporter\nOther Dossier men's fragrances\nFive bottles of different Dossier men's colognes on a table.\nAmir Ismael/Insider\n\nDossier Spicy Vanilla Cologne\nDossier Spicy Vanilla\nCheck price at Dossier\nDossier Musky Oakmoss\nDossier Musky Oakmoss\nCheck price at Walmart\nCheck price at Dossier\nDossier Aquatic Lime\nDossier Aquatic Lime\nCheck price at Walmart\nCheck price at Dossier\nDossier Citrus Ginger\nDossier Citrus Ginger\nCheck price at Walmart\nCheck price at Dossier\n\nI was so happy with how closely Dossier matched the Dior fragrance I already had, I decided to try a few scents that I didn't own. I've always liked to try new scents, but more often than not, steep prices turned me back to the fragrances that I already knew I liked.\n\nAlthough I received a few samples for the purpose of this review, I've already purchased a few extras myself.\n\nI tried Spicy Vanilla, Musky Oakmoss, Aquatic Lime, Citrus Ginger, and Woody Sandalwood, and while I like some more than others for daily wear, I like having options at a low cost. I might not have a familiar point of comparison for most of the Dossier fragrances in my collection. Still, it sure beats spending upwards of $1,000 on brands like Creed, Tom Ford, Chanel, and Giorgio Armani to create the same variety. — Amir Ismael, Insider Reviews senior reporter\nOther Dossier's women's fragrances\nDossier Floral Marshmallow\nDossier Floral Marshmallow\nCheck price at Walmart\nCheck price at Dossier\nA bottle of Woody Sandalwood cologne.\nDossier Woody Sandalwood\nCheck price at Walmart\nCheck price at Dossier\n\nI also opted to try Dossier's Floral Marshmallow (a dupe of By Kilian's Love, Don't Be Shy) and Woody Sandalwood (inspired by Le Labo Santal 33). Both are scents on the warmer side. While I don't have the luxury versions to compare the scents to, I would happily repurchase both fragrances. I still fight the urge to apply more mid-day. — Kayla Bickham, Insider Reviews style and beauty fellow\nHow does Dossier maintain affordable prices?\nA newly opened box of a Dossier fragrance in unbranded and low-cost packaging.\nAmir Ismael/Insider\n\nAs consumers, we've been conditioned to expect premium colognes and perfumes to cost a lot. Purchasing a high-end fragrance is looked at as a luxury splurge but never as a simple part of your grooming routine. So, naturally, the first thing new customers want to know is how Dossier can make these so cheap.\n\nFirst and foremost, there is no substantial retail mark-up because of the brand's direct-to-consumer model. The brand also limits costs by using generic packaging. All of the bottles are made from 100% recycled glass and come in a 100% recycled cardboard box. However, by far, the most noteworthy cost-saving is the generic branding. There's no inflated cost because there's no luxury brand name on the bottle. When you buy a bottle of Dossier, you're just paying for the same high-quality ingredients used by designer brands, Dossier's affordable packaging, and a profit margin, which is expected for any business.\n\nDossier also has a buy more, save more deal to save you additional money. Buy three items from $78 and get 10% off; buy four items from $99 and get 15% off; or buy five or more items from $116 and get 20% off. You'll also get free shipping on three or more items.\nDoes Dossier perfume last?\n\nIn former Business Insider Reviews style & beauty fellow Kayla Bickham's experience, Dossier's Ambrey Vanilla perfume did not last all day long. However, her tip to stretch all perfumes is to apply them fresh out of the shower, air dry, and then lock the scent in under a body lotion.\nCons to consider\n\nThe only point that might deter some people from Dossier is the generic packaging. If you enjoy collecting unique bottles to display on your vanity or bathroom countertop, you won't be able to accomplish that with Dossier. If you're okay with all of your bottles looking similar — and the tremendous amount of money you'll save — then there shouldn't be anything stopping you from buying Dossier. And if our reviews of Dossier compared to popular fragrances aren't enough to convince you, try it for yourself. Dossier's risk-free returns allow you to try fragrances and send back full-size bottles for a full refund with no questions asked.\nThe bottom line\n\nOverall, we can't recommend Dossier enough for anyone looking for affordable cologne or perfume. We each tried scents that mimic name-brand fragrances that we know and love and were impressed with how close they match.\n\nNot only will you save money on popular fragrances you're already familiar with, but shopping at Dossier will empower you to explore new scents.\n",
        "strength": 0.7199999856200003,
        "metadata": {
          "source": "data/3.md",
          "title": "3",
          "type": "document",
          "file_size": 9880
        },
        "created_at": "2025-07-17T21:04:12.031969",
        "last_accessed": "2025-07-17T21:04:12.031970",
        "id": "pattern_118d7167_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779570",
      "influence_count": 0
    },
    "pattern_2161f667_1752800652": {
      "pattern": {
        "content": "Document: 3\nDossier review: These under-$50 designer fragrance dupes will replace your expensive originals\nWritten by Amir Ismael edited by Maiya Pascouche\nWhen you buy through our links, Business Insider may ear...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/3.md"
        },
        "created_at": "2025-07-17T21:04:12.035442",
        "last_accessed": "2025-07-17T21:04:12.035443",
        "id": "pattern_2161f667_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779574",
      "influence_count": 0
    },
    "pattern_482690dc_1752800652": {
      "pattern": {
        "content": "The L in GTL\n\nHere is another idea to get you thinking about selling to women with a repeat consumable product. Not quite the same as press-on nails, but similar – laundry detergent, specifically the concept of elevating every day routines to luxury experiences. Are the margins super amazing? Maybe not lights out, think gross of 50-70% with a net in the 25% plus range, depending on how you set up your pipeline (heavy emphasis on robotics here, more on that later). And.\n\nThe nexus here is a repeat consumable. Set it on subscribe on Amazon and forget it. Got no worries about competition because this is the new reality (Luxury everyday experiences)\n\nSource\nIdeal Customer\n\nWe are creating a fragrance-driven laundry brand targeting style-conscious women aged 25-45 (sweet spot likely in the 28-38 year range) in major metro areas in the $50-150k/year household income bucket, who are active on cleantok, where mundane chores are presented as luxury rituals. Other things to look for are “quiet luxury” products marketed as items gate kept from the general public, example here (Source).\nCase Study\n\nTyler Glamorous Wash went cult almost “overnight” on cleantok with its “Diva” product a couple of years back. (Reminder: Is this outside of your wheelhouse? Use AI to help you track and understand these trends.). Tyler Candle Company made a mini version of their laundry detergent available, got a few influencers involved, and little by little, the UGC inertia took over.\n\nSource\n\nHere is a link to the full “gift set” like you would see for cosmetics or fragrances, not smaller bundles are available and take note that the bottles themselves are not particularly high end packaging, but the names are very intentional here for the different fragrances: Wishlist; Diva; Icon; High Maintenance; Limelight; Entitled; Trophy. (Source)\n\nThis product is still cranking years later, with over 5,000 of this SKU sold in the past month on Amazon (32 oz version). Read the reviews – women are asking about this at the salon when their hair is washed and the smell towels being used, they are smelling clothes moms are bringing to school and immediately adding to cart when they find out what it is. Sure, that strong of a scent might be too strong for some, but it does not matter. Niche auto buy is the play here via referrals.\n\nSource\n\nTwo others to mention here – Dedcool (Source) and Dirty Labs (Source) have followed similar playbooks, but with different aesthetics (cool girl and eco friendly dish focus).\n\nSource\n\nSource\nRoad Map\n\nSo we know what we are selling and to whom, let’s test some demand before we do anything else, shall we? To do that, we need a creative mock up and some branding. You can use Canva, or our favorite AI tool. Here is what I got in one try asking for some high end branding ideas based on fragrance house branding. It came up with the labeling, names and designs. My exact request was: “Create a sensory, elegant brand world where each scent evokes a distinct experience—much like high-end perfume houses (e.g., Le Labo, Byredo).”\n\nIs this perfect? Nope, but it doesn’t matter. Let’s get the copy it generated too for a quick landing page we will throw together too.\n\n1. Cashmere Blossom\n\n   Tone: Elegant, powdery floral\n\n   Label Copy:\n\n“A soft caress of blooming petals wrapped in the warmth of sunlit cashmere. Romantic and effortlessly refined.”\n\n    Color Scheme: Blush pink with rose gold foil\n\n    Symbol: Watercolor petal motif or abstract textile weave\n\n2. Midnight Peony\n\n   Tone: Seductive, deep floral\n\n   Label Copy:\n\n“An evening bloom steeped in mystery—velvety peony, whispers of dark plum, and a trace of vanilla smoke.”\n\n    Color Scheme: Matte plum with copper foil\n\n    Symbol: Peony silhouette with crescent moon overlay\n\n3. Golden Linen\n\n   Tone: Clean, warm, sun-drenched\n\n   Label Copy:\n\n“A sunlit embrace of clean linen, warmed by golden amber and softened with sandalwood musk.”\n\n    Color Scheme: Cream + gold accents\n\n    Symbol: Geometric weave pattern or golden thread motif\n\n4. Seaside Neroli\n\n   Tone: Crisp, aquatic citrus\n\n   Label Copy:\n\n“Breezy neroli blossoms and salt-kissed citrus—like a coastal breeze through white cotton sheets.”\n\n    Color Scheme: Soft aqua + pearl white\n\n    Symbol: Nautical line drawing or droplet\n\n5. Elysian Drift\n\n   Tone: Airy, dreamlike\n\n   Label Copy:\n\n“A celestial veil of lavender and almond flower drifting through clouds of whipped iris and musk.”\n\n    Color Scheme: Lavender mist + silver\n\n    Symbol: Abstract wing or constellation pattern\n\n🖋 Label Design Elements\n\n    Bottle: Refillable minimalist bottle (semi-opaque frosted finish)\n\n    Typography: Serif for scent name + sans-serif for description\n\n    Material: Soft-touch label or embossed linen paper for tactile elegance\n\n    Optional Features: QR code linking to a “scent journey” playlist or scent origin story\n\n📌 Strategic Notes\n\n    Each label should feel like part of a perfume bottle meets interior décor object.\n\n    Avoid clutter—luxury is space, breath, and clarity.\n\n    Make each bottle Instagrammable in a shelfie or laundry ritual video.\n\nWhen we dive in for some tagline ideas, here is what it came back with (note, I’m literally only a few clicks into brainstorming here, this is not high intensive effort by any means).\n\nTagline Development:\n\n    \"Elevate Every Wash\" - Action-oriented, aspirational\n\n    \"Indulge Your Senses, Refresh Your World\" - Sensory focus\n\n    \"Where Clean Meets Couture\" - Luxury positioning\n\nVisual Identity System:\n\n    Color Palette: Soft, elegant hues (blush pinks, muted golds, creamy whites)\n\n    Typography: Modern serif or script fonts for feminine, high-end appeal\n\n    Logo Design: Minimalist with subtle luxury cues\n\n    Package Design: Sleek bottles with metallic accents and embossed details\n\nScent Storytelling and Product Naming\n\nFragrance Narrative: Each scent should tell a story that transports customers:\n\n    \"Cashmere Blossom\" - Luxury textile meets delicate florals\n\n    \"Midnight Peony\" - Sophisticated evening elegance\n\n    \"Golden Linen\" - Warmth, comfort, and refined luxury\n\nScent Description Writing: Create immersive, perfume-style descriptions:\n\n    Use sensory language that evokes emotions and memories\n\n    Reference luxury experiences and aspirational lifestyles\n\n    Include suggested use occasions and mood settings\n\n    Connect fragrance to lifestyle and home aesthetics\n\nBrand Voice & Messaging\n\nTone and Communication Style:\n\n    Warm, inviting, and empowering\n\n    Aspirational but accessible\n\n    Community-focused and inclusive\n\n    Sophisticated without being pretentious\n\nCore Messaging Pillars:\n\nSelf-Care and Ritual: \"Transform laundry into a moment of self-indulgence. Every wash becomes a ritual of care for yourself and your home.\"\n\nHome as Sanctuary: \"Your signature scent for your sanctuary. Create a home environment that reflects your personal style and sophistication.\"\n\nSustainability with Luxury: \"Luxury that loves the planet. Premium quality without compromise to environmental values.\"\n\nCommunity and Sharing: \"Join a community of women who understand that life's everyday moments deserve extraordinary care.\"\n\nAlright then, now that we have the copy, you can generate a quick landing page you put up on a quick site (hint, ask AI again to generate and preview a landing page based on one of the brands listed above, I used dedcool), snippets below. Again, this doesn’t matter, just have something as a placeholder you can iterate on later. Snag the html from your AI, get a domain on namecheap or similar, set up your minimal hosting, you are off to the races. Ideal spend here is not heavy, maybe a few USTT for a domain and the cheapest hosting plan/email set up you are comfortable with.\n\nOnto ads, this is going to take some research, but AI can do this for us too, as I’ve talked about in the past.\n\nFirst, create your handles – tiktok, Instagram and pinterest.\n\nRemember, the idea here is to test demand, we want to get a list of emails of “besties” who “want in” when we are “back in stock”.\n\n    Target women ages 25-45 in major urban areas\n\n    Layer interests: luxury lifestyle, interior design, premium beauty\n\n    Use TikTok In-Feed ads and Spark ads for cost-effective reach\n\n    Focus on authentic, user-generated content style\n\nSource\n\nCopying here for those who want to view it on Substack. Can replicate this yourself on any other “luxury everyday experience” trend that fits your style\n\nKey Viral Luxury Laundry Ads and Trends on TikTok\n\n    #BestLuxuryLaundryDetergent\n\n        This hashtag is associated with over 46 million posts, indicating a massive interest in luxury laundry products among TikTok users (Source). Videos under this tag often showcase premium detergents with exotic scents, stylish bottles, and influencers sharing their personal favorites.\n\n    Creator Highlights\n\n        Sapphiredelight: A video titled “Luxury Laundry Detergent: A Fragrant Obsession” received 87,400 likes and nearly a thousand comments, emphasizing the allure of high-end laundry scents (Source)\n\n        The Crazy Cleaning Lady 22: Her video on “Luxury and Modern Laundry Detergent for Tropical Scent Lovers” highlights the appeal of unique, vacation-inspired fragrances in luxury laundry care (Source)\n\n        SouthernBelle: Uses the hashtag #luxurylaundrydetergent and posts videos that blend laundry care with a sense of luxury, appealing to viewers who want to elevate their everyday experiences (Source)\n\n    Trending Scents and Comparisons\n\n        LUXE Scent: Multiple creators, such as at barndowife at mkbenn and , have posted videos raving about luxury laundry detergents in the “Luxe” scent, comparing them to other high-end laundry products (Source)\n\n        Diva Wash Comparisons: The hashtag “Luxury Laundry Detergent That Smells Like Diva Wash” is associated with over 36 million posts, showing the popularity of this specific scent comparison (Source)\n\n    TikTok Shop Laundry Detergent Campaigns\n\n        TikTok Shop features luxury laundry detergent products, with ads and videos that highlight the best-smelling and most luxurious options available for purchase directly on the platform (Source)\n\n        These campaigns often use influencer partnerships, user-generated content, and seamless shopping integrations to drive engagement and sales (Source)\n\n    What Makes These Ads Viral?\n\n        Scent-Driven Content: Videos focus on the sensory experience, with creators opening bottles, sniffing clothes, and describing the fragrance as if it were a luxury perfume\n\n        Lifestyle Aspiration: The ads and videos position luxury laundry detergent as a way to elevate daily routines, appealing to viewers’ desire for self-care and indulgence\n\n        Interactive and Relatable: Influencers and everyday users share their genuine reactions and routines, making the content feel authentic and relatable\n\n        Hashtag Challenges and Trends: Hashtags like #luxurylaundrydetergent and #laundrytok help these videos reach a wider audience and encourage user participation\n\n    Ad Format Strategy:\n\n        Short-Form Video (10-15 seconds): Mix still images with video transitions\n\n        Multiple Faces: Show diverse users to increase relatability\n\n        Lifestyle Integration: Beautiful home settings with aspirational feel\n\n        Sensory Focus: Highlight luxury packaging and fragrance experience\n\n    Hook Development: Lead with captivating text overlay or voiceover in first 2 seconds:\n\n        \"The secret to making your home smell unforgettable—revealed\"\n\n        \"Why luxury hotels always smell amazing (and how to get it at home)\"\n\n        \"The laundry hack that turned my routine into self-care\"\n\nSuccess leaves instructions clues, anon. Follow them.\n\nTake these ads above as inspiration and create your own, based on the guidelines above, use AI and ask it to show you how to use Canva or Capcut if you are not already familiar.\n\nNow for spend, your mileage may vary, but generally CPCs on TikTok for me land in the $0.17-$1.00 range, with an average between $0.50 and $1.00. Assume a max conversion of 20%, and I’m at a CPL of $2.50 on the low end and $5 on the high end. Usually I am in the ~$500 spend range to get opt ins for a list started, so I’m expecting 100-200 leads based on that budget, assuming my creatives are landing and my influencer targeting was correct, which is why the intel above from AI is so useful. Again, not super in the weeds here, maybe 20 minutes into this project, and I have already identified a roadmap, basic branding ideas, gotten a simple landing page up, and created an ad plan.\n\nThe iteration will take time, not forever, but approval usually takes a day, and then the algo needs a day or three to figure out your target demo, which is why using influencers from the jump can be so helpful. Give yourself at least a week to collect intel before pivoting, I’d start at $50 ad spend per day initially, and if you are gaining traction, start to ratchet up. This is why I said under $1k at the jump, you want breathing room here in case you hit something that is working. Worst pain in life is seeing something taking off and not being able to have the runway for it to fully take flight. Even assuming $500 initial ad spend, and de minimis costs on the domain/landing page set up, you should still have a decent buffer to pivot with here before reaching the four figure mark.\n\nSo you let your ads run, you are gaining traction with your influencers and you have a solid list of interested customers, congratulations! Now we can move onto formulation/production.\nRise of the Machines\n\nThanks to Tyler’s line and their Diva product, we know what scent profile and formulation our target customer likes. This makes it rather straight forward from a formulation perspective. I personally would not only have a “Diva” equivalent, but also another mini trial set for optimal virality on UGC. The key here is two fold – the use of robotics and avoiding tariff noise. Here is how we do that at the time of this writing.\n\nLuxury laundry detergents are ideal candidates for robotic manufacturing due to precision requirements in formulation and packaging (e.g. precise ingredient measurement for consistent fragrance profiles, automated pH and viscosity control, scalable production, et al).\n\nWhy Mexico?\n\nTariff Benefits:\n\n    Duty-free export to U.S. under USMCA for compliant goods\n\n    Exemption from 25% U.S. steel tariffs for Mexican-sourced materials\n\n    PROSEC program reduces input tariffs for export-oriented manufacturing\n\nCost Advantages:\n\n    Approximately 70% lower labor costs compared to U.S. manufacturing\n\n    3-5 day shipping to U.S. markets versus weeks from Asia\n\n    Advanced manufacturing infrastructure with skilled workforce\n\nSupply Chain Resilience:\n\n    Reduced dependency on Asian supply chains\n\n    Proximity enables rapid response to viral demand spikes\n\n    Simplified logistics for North American distribution\n\nNow then, who could we use for our project? Here is a list below. Keep in mind these facilities are hybrid, meaning robotic formulation with semi-automated packaging. Note, again, this is all compiled with AI’s help.\n\nTop Mexican Maquiladoras for Detergent Formulation\n\nEUROCHEM\n\n    Specializes in cleaning and specialty treatment chemicals\n\n    Focus on green technology and industrial cleaning solutions\n\n    Strong capabilities in custom detergent formulation\n\n    Ongoing expansion in cleaning products sector\n\nHJB Química Internacional\n\n    Over 15 years of chemical manufacturing experience\n\n    Supplies raw materials and finished products for household sectors\n\n    Expertise in surfactants and fragrance components\n\n    Established relationships with personal care industry\n\nAromáticos y Químicos del Centro\n\n    High-quality fragrance and chemical manufacturing\n\n    COFEPRIS regulated with extensive compliance experience\n\n    Specialized in home and personal care industry supply\n\n    Strong fragrance development capabilities\n\nDesarrollo de Especialidades Químicas\n\n    Established in 1986 with proven track record\n\n    Specializes in high-quality chemical products and laboratory reagents\n\n    Tailored solutions for research, analysis, and industrial processes\n\n    Experience in detergent manufacturing and development\n\nNostalxico S de RL de CV\n\n    Leading detergent soap supplier in Mexico by export volume\n\n    Substantial experience in laundry detergent manufacturing\n\n    Established export relationships and logistics networks\n\n    Strong candidate for maquila partnership arrangements\n\nAnd from there, we’d set up a 3PL, ideal candidates would be many of the usual suspects, although Shipbob and I have not always had the best relationship, YMMV, and Amazon would get a mention here too eventually.\n\nShipfusion\n\n    Strengths: 99.9% order accuracy, white-glove service specialization\n\n    Ideal For: High-value products requiring precision handling\n\n    Key Benefits: Premium fulfillment experience, advanced tracking\n\nBuske Logistics\n\n    Strengths: Century-old expertise in luxury home goods\n\n    Ideal For: Brands prioritizing elegance and security\n\n    Key Benefits: Established luxury market experience, premium handling\n\nZendbox\n\n    Strengths: Specializes in luxury unboxing experiences\n\n    Ideal For: International expansion, particularly UK/EU markets\n\n    Key Benefits: Global fulfillment network, premium presentation focus\n\nShipBob\n\n    Strengths: Cost-effective for startups, 2-day shipping capabilities\n\n    Ideal For: Early-stage brands balancing budget and scale\n\n    Key Benefits: Rapid scaling support, competitive pricing\n\nIdeally 3PL is a set and forget situation, but more than likely, there will need to be adjustments made here. And for those who may not be aware, at a high level, the pricing for these usually works out to be:\n\n    Fulfillment Fees: $3-$5 per order for standard packaging\n\n    Premium Packaging: Additional $1-$2 for custom branded materials\n\n    Storage Fees: $0.50-$1.50 per cubic foot per month\n\n    Integration Costs: One-time setup and ongoing management fees\n\nOnce you have these legos in place, you can turn your ads back on and start the machine running in earnest.\n\nAll of this took me about a half hour to spec out. Not saying I’m a genius by any stretch, just muscle memory and looking into an opportunity I see gaining more and more traction.\n\nSide note, some tools I should mention, as you guys know I am always tinkering with workflows. I’ve found the below helpful.\n\n    VAs for me are largely a thing of the past. I’ve replaced almost all of my Bangladeshi friends with a version of open source Claude desktop, MCP and puppeteer\n\n    Product dev for apps and such is still really heavy Cursor for me. I play the Claude vs ChatGPT game getting them to one up each other with the best prompt for a certain task for Cursor, and either make sure I spec it out in Tempo first if need be, or go straight to Cursor\n\n    Testing - Source and Source\n\n    Feedback and analytics - Source and Source\n\n    Customer/user intelligence - Source\n\n    Still testing - Beacon - No recommendation at this point on this one just a *potential* tool\n\nBut then again, what do I know? I’m just a cartoon mouse who can’t even find a tent these days.\n\nBack to the sewer.\n\nIn Conclusion\n\nGrateful once again to BTB for giving me the space to write here. Hope you found this helpful, you can find me sometimes posting/RT-ing on X FKA Twitter The_CryptoMouse\n\nAs always, shoot me a DM if you find yourself stuck, always happy to help out the jungle. Will do my best to catch up as quickly as I can on DMs, and make sure you are on my mailing list.\n",
        "strength": 0.7199999856200003,
        "metadata": {
          "source": "data/4.md",
          "title": "4",
          "type": "document",
          "file_size": 19686
        },
        "created_at": "2025-07-17T21:04:12.037243",
        "last_accessed": "2025-07-17T21:04:12.037244",
        "id": "pattern_482690dc_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779630",
      "influence_count": 0
    },
    "pattern_1be66c86_1752800652": {
      "pattern": {
        "content": "Document: 4\nThe L in GTL\n\nHere is another idea to get you thinking about selling to women with a repeat consumable product. Not quite the same as press-on nails, but similar – laundry detergent, specifically the ...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/4.md"
        },
        "created_at": "2025-07-17T21:04:12.048479",
        "last_accessed": "2025-07-17T21:04:12.048480",
        "id": "pattern_1be66c86_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779635",
      "influence_count": 0
    },
    "pattern_1fe3c3b5_1752800652": {
      "pattern": {
        "content": "First off, I would like to thank BTB for allowing me to use their platform to share my story. If it wasn’t for them and the entire community they built, I would probably be a poverty-stricken gym teacher. Thank you for sending the ladder down.\n\nNow for the journey of PreSleep.\n\nPreSleep may seem “new” to most of you reading this, but the journey began over a year ago when I was a broke college senior.\n\nI subscribed to BTB, and I started investing in BTC and ETH, thinking I’m well on my way to Degen Island.\n\nOnly to soon realize that even a 20x moonshot on $1,000 of ETH wasn’t going to make a life changing difference.\n\nI began to notice every other post wasn’t just about crypto. It was about starting a business and how to create multiple income streams that make money while you sleep.\n\nI knew absolutely nothing about Ecom, marketing, sales, logistics, website design, or copywriting. You name it; I didn’t know how to do it. College certainly didn’t.\n\nAll I knew was that I had to start.\nThe Idea\n\nAs a college athlete, I had to wake up at 5am daily for morning workouts. This schedule was really taking a toll on my sleep.\n\nI turned to melatonin, which would help me fall asleep, but I never reached quality sleep. I would feel like I had been hit by a truck when I woke up in the morning. Not ideal when going to lift at 5am.\n\nI began to do some research and realized there were better ingredients that I could use to get quality sleep. As I dug deeper, I found that most sleep supplements thought leaders were using:\n\n    Magnesium\n\n    Glycine\n\n    L-theanine\n\nI started taking these supplements, and I noticed my sleep got significantly better. I felt much more refreshed when I woke up.\n\nI couldn't find a product that had all of these ingredients together in efficacious doses. Then it hit me.\n\nWhy not make it into an all-in-one formula that you could drink and that tasted good? Liquid supplements will also dissolve faster and, in turn, absorb quicker. This process allows the liquid supplement to work faster than pills.\n\nThis is when the idea for PreSleep was born. I knew I had a lot of work to do to get this going. I paid someone on Fiverr 70 dollars to do my logo, and I got my LLC up that same week. I was off to the races. Please don’t overthink this part.\nDemand Test or Lack Thereof\n\nAfter reading Efficiency by BTB, I knew the optimal way to test demand would be:\n\n    Set up a landing page\n\n    Run ads to the page\n\n    See if you get sales\n\n    If you don’t get any sales, abandon the product or adjust copy, creative, etc\n\nI didn’t do any of that. I was broke and had $1,000 to my name because I was still in college. Instead, I devised a balling on a budget demand test.\n\nI decided my version of a demand test would look something like this:\n\n    Buy the ingredients of PreSleep in bulk and blend them myself\n\n    Cold outreach to Instagram influencers via DMs\n\n    Send the homemade version to Instagram influencers\n\n    Ask them to post and drive traffic to my email list\n\nIt wasn’t perfect by any means, but after doing influencer outreach every day for the month of January, here were the results, by February:\n\n    I got calls from a professional sports team to buy PreSleep for the whole team\n\n    I had multiple influencers who had positive reviews\n\n    107 email subscribers\n\n    My DM’s were loaded with people begging me to launch\n\nAt this point, I had enough confidence to feel that the idea was validated and could be scaled. My dad had taken notice of how much work I had been putting in day in and day out.\n\nHe was also using the homemade version of PreSleep every night and loved it from the very beginning. He felt comfortable funding the initial capital for inventory from an FDA approved supplier to get me started.\n\nPreSleep was finally moving from my parents kitchen blender to a real production operation.\nNavigating the Manufacturing Side\n\nWhat I should’ve done:\n\nThis is something I wish I had done a better job of selecting, to be completely honest. Many headaches would’ve been saved if I had selected a better supplier from the beginning.\n\nThe best way to find manufacturers is NOT through Google.\n\nThere are some quality manufacturers in the USA, but they are extremely hard to find unless\n\n    You have an existing relationship with a supplier\n\n    You get a referral\n\n    Hire a consultant to help with this\n\nIf you are looking to find a manufacturer, I highly recommend working with someone who has a wealth of knowledge in the space.\n\nI used Blue Ocean Advisory to help me find a new supplier, and it has saved me so much time and energy.\n\n_Not affiliated, I just think they do a great job._\nThe Launch or the Splatt\n\nAfter working for 7 months straight, seeing no results, the hard work finally paid off, and I made $1,700 that first month. At the time, I was ecstatic, but that excitement would be short lived.\n\nBecause here’s how the next few months of revenue went:\n\n    Sept: $1200\n\n    October: $900\n\n    November: $850\n\nRuh roh! Not a great trend, kind of like when a shitcoin launches and slowly fades into irrelevance.\n\nAt the time, all sales were coming from one channel: organic TikTok content.\n\nI learned this entirely through BowTiedTikTok’s discord.\n\nNote: If it hadn’t been for joining BowTiedTikTok’s discord, I wouldn’t have sold any units, so shout out to him for coaching me through creating viral videos. I mainly use his discord now to find quality UGC creators. Check out his discord here _Disclaimer_: This is an affiliate link because I believe in capitalism, and you should too.\n\nAnyway, back to PreSleep. This whole 4-month period was the largest gut punch since starting the business.\n\nAt this point, I was out of college and working a full time job as an SDR, doing the typical 9-5 grind of ripping dials and hustling meetings.\n\nOnce I was off the clock, I’d begin to grind out work for the business, and during that period of time, it was mostly working on getting more eyeballs on the product by creating TikTok content.\n\nThe bulk of the time would be spent creating TikTok videos every night until 1am or later.\n\nI spent everything I earned at my W2 on PreSleep and reinvested all of the small profits back into the business.\n\nI hardly saw any results. I would get a sale every other day if I was lucky. I’ve had my fair share of 0 sales days/weeks which would only add to my stress and anxiety.\n\nI desperately spent $4,000 on TikTok creators to help promote PreSleep. That turned out to be a total waste of money.\n\nI honestly thought about quitting every day. I had so many negative thoughts swirling around my head.\n\nIs this the right niche? Am I working on a lost cause? Does my product suck? Do I suck at this? Did I waste my dad’s money? Why didn’t I do a proper demand test like BTB said!\n\nAt this rate, I wouldn’t sell out of inventory FOR AN ENTIRE YEAR.\n\nI was on the verge of slipping into depression. I had so much hope going into this, but I was failing to get any sort of traction at scale.\n\nWorst of all, it wasn’t my money invested, so I felt even worse, but I had no choice but to wake up everyday and continue to try. I owed it to my dad.\n\nThis is probably where most people would give up. It’s not sexy to wake up and do the same thing every day with 0 results.\n\nLooking back, I realize that this was just one of my many valleys of despair.\nA Glimmer of Hope\n\nOut of slight desperation, I decided to listen to my good friend TJ of Ramp Health on advice he had been giving me for months: promote PreSleep on Twitter/X,\n\nIt proved to be one of the greatest decisions I made for the business.\n\nBowTiedNeuron posted the first PreSleep review on Twitter/X and I revealed that I was the owner behind the brand. After that post, my phone blew up with sales like I had never seen before. My first big break. Almost exactly 1 year from starting the business.\n\nThat night was truly one of the craziest experiences of my life, and it was the most amount of money I had ever made in a single day at the time.\n\nMy girlfriend and I packed orders all night, but it didn’t matter, I was riding high like no other.\n\nThis is when I knew I could make it work. We finally had a winning strategy. Painfully simple yet effective.\n\nBut this doesn’t mean that there are no more problems in the business…\nThe Supplier Fiasco\n\nOnce I had about half of our inventory left, I placed another order with my manufacturer and was so excited because I knew we would sell out of our first round of inventory fast.\n\nThis excitement was short-lived.\n\nThis next batch of inventory tasted completely different from the first. It was a massive punch in the face. I knew I couldn’t ship these units. It would’ve been a disservice to everyone that purchased to give them something I myself wouldn’t use.\n\nThis obviously left a bad taste in my mouth (literally and figuratively). This is when I knew I needed to find a different supplier, and thankfully I did.\n\nThis has ultimately been the main reason why PreSleep has had so many delays due to inefficiencies and empty promises by our supplier.\n\nBut being sold out is “such a good problem to have,” right? No, not at all.\n\nIt’s been extremely stressful, and it could’ve been avoided by finding the right manufacturer in the beginning.\nThe Future of PreSleep\n\nLeaning on affiliates has been the biggest mover so far for PreSleep.\n\nI rinsed and repeated this strategy of finding Twitter accounts who met the following criteria:\n\n    Find an account in the health/fitness niche\n\n    Make sure they have an engaged following\n\n    Verify they have an audience of at least 5k followers\n\n    Send PreSleep for no charge\n\n    If they like it, I would ask for a post\n\n    Offer an affiliate code so they can get a cut for their support\n\nIt’s simple, win and help win. Momentum grew, and similar results occurred.\n\nNow I have my VA do most of this, so I can free up my time to work on other aspects of the business.\n\nI have also outsourced fulfillment after many late nights of fulfilling orders with my girlfriend, mom, and dad. They were very thankful I got a 3PL. They were overworked and underpaid.\n\nOur supply chain is currently in shambles due to having to switch manufacturers, but I promise this will only be temporary.\n\nOverall, the future of PreSleep is bright:\n\nI have a massive announcement that is coming up, and I will be able to talk more about it in the coming months.\n\nLet’s just say I don’t think we will be selling out for too much longer…\nConcluding Takeaways:\n\n    Just start; it’ll never be the perfect time\n\n    Do not stop.\n\n    Test demand for your product before buying inventory\n\n    Once you find a winning strategy for getting customers, triple down on it.\n\nI’m not a genius. To get this far, I showed up every day, didn’t get paid for it, spent thousands of dollars on an unknown outcome, and willed it into existence.\n\nWhen I was doing 0 sales a day for weeks, I would daydream of moments where my Shopify notifications would blow up my phone.\n\nFor those of you out there only doing a couple sales a week, and struggling to get traction, do not quit. It sucks, and it’s painful working every single day and seeing no results, but this is the right of passage.\n\nHaving this mindset is the only way to continue on. Don’t dwell on it. Just keep getting better, one day at a time.\n\nThis attitude has legitimately been why I was able to get PreSleep where it is today and have legitimate exit velocity to work on PreSleep full time (soon).\n\nThat’s my story, I hope someone out there can find some value in this and learn something.\n\nYou can find me on Twitter/X BowTiedVampDeer and if you’re interested in checking out PreSleep you can find it here and if we’re sold out at the time you're reading this, don’t blame me; blame my supplier.\n\nThe goal of this post was to show you the raw work it takes to bring a brand to life. The path isn't easy, but god damn, it's worth it.\n\n-BowtiedVampDeer\nSpecial Thanks to those Supporting PreSleep:\n\n    Again, huge thank you to BowtiedBull for letting me share my story with their audience\n\n    My dad for supporting my business without him PreSleep wouldn’t exist.\n\n    My mom for making a million post office runs for me while I worked my W2\n\n    My girlfriend for being the most supportive person in the world.\n\n    Tommy Salami for being a great friend and mentor throughout this entire process.\n\n    BowtiedQuoll for editing this post and his help with copywriting.\n\n    BowTiedTikTok for showing me how to create viral content.\n\n    BowtiedCommoner for having me on her podcast “Common Sense”.\n\n    BowtiedJester for keeping me focused on content creation.\n\n    BowtiedFawn for always being available to offer her valuable insight.\n\n    BowtiedOpossum for reframing my perspective on supply chain.\n\n    BowtiedCocoon for helping me get a W2 sales job.\n\n    Everyone that has purchased PreSleep and supported my dream.\n",
        "strength": 0.9899999802275002,
        "metadata": {
          "source": "data/7.md",
          "title": "7",
          "type": "document",
          "file_size": 12907
        },
        "created_at": "2025-07-17T21:04:12.051955",
        "last_accessed": "2025-07-17T21:04:12.151791",
        "id": "pattern_1fe3c3b5_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779667",
      "influence_count": 0
    },
    "pattern_98565a0d_1752800652": {
      "pattern": {
        "content": "Document: 7\nFirst off, I would like to thank BTB for allowing me to use their platform to share my story. If it wasn’t for them and the entire community they built, I would probably be a poverty-stricken gym teac...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/7.md"
        },
        "created_at": "2025-07-17T21:04:12.062338",
        "last_accessed": "2025-07-17T21:04:12.062339",
        "id": "pattern_98565a0d_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779672",
      "influence_count": 0
    },
    "pattern_b30eceec_1752800652": {
      "pattern": {
        "content": "Hello, anon. I'm BowTiedStealth, founder of Turret Fitness (what used to be Gript, which we'll get into).\n\nStarting this biz has taught me infinite things that would have been impossible to learn had I not done it myself (and I have an MBA…lol). My hope is that this post shows you some of the pitfalls that await any who dare to start a business.\n\nFor starters though, a huge thank you to BowTiedBull for the opportunity to write this post. Their Substack has been absolutely invaluable while starting and building Turret Fitness.\nIdeation\n\nI'll be the first to tell you that my vacuum insulated stainless steel protein shakers are not groundbreaking.\n\nI'm not Steve Jobs over here introducing the first phone with no buttons.\n\nWhen I started Gript, I was simply trying to solve my own problem of protein sitting in a plastic shaker for multiple hours while I drive to the gym, lift, shower, drive to the office, and then drink it. A quick google search didn't show me anything that I actually wanted to buy, so I decided to make my own.\n\nThat was about it.\n\nIdeas are a dime a dozen, so just pick one that you don't mind thinking about all day every day, and move out on it.\nName\n\nIt's popular around these parts to say that the name of your biz doesn't matter that much, and I tend to agree.\n\nHowever, it is important that you pick something that people will remember, generally fits the idea/vibe you have for the biz, and most importantly...IS NOT ALREADY TRADEMARKED.\n\nWhen I was signing up for Amazon Brand Registry, I learned you need at least a pending trademark to get registered.\n\nOkay, time to go get a trademark for the name GRIPT.\n\nI HIGHLY recommend using a law firm to submit your trademark application on your behalf, for three reasons.\n\n    You need a law firm to sign off on it, even if you do it yourself\n\n    Your time is better spent doing things other than learning the process for properly submitting a trademark application\n\n    It’s good to have a relationship with an IP law firm should you need one later, whether to play offense or defense\n\nTurns out there are enough other trademarks similar enough to “GRIPT” that the law firm assessed my probability of success as “low”.\n\nTime to rebrand.\n\nThat’s why and how I went from GRIPT to Turret Fitness. Nothing else about the business changed when I did that.\nLegal Stuff\n\nWhile we’re on the topic of legal stuff, allow me to introduce you to the idea of an \"IP Portfolio\". I am far from an expert on this, and I'm not a lawyer or attorney or anything related, so consult one if you need one.\n\nYour IP Portfolio is the collection of patents and trademarks that make your business unique.\n\nYou need to be building your IP portfolio as you build your business. However, it's important to balance how much of this you do. Every patent and trademark application costs money, so it's up to you to find the right balance between what does and does not need to be protected, at least initially. Do not blow your entire launch budget on IP protection and then have no money left to buy your inventory, start running ads, etc.\n\nIf you want to sell on Amazon (you should want to sell on Amazon), you will need at least a pending trademark for your business name to do so. I did not know this.\n\nIf you do have some revolutionary product, you will want to patent it, be it a design or utility patent. I'm not qualified to go into details on this, so DYOR.\n\nAny potential legal challenges you face can cost you tons of time and money that is much better spent on other things.\n\nDo not take this stuff lightly. It adds up quickly.\nLogo\n\nThis is one thing that I will say you should spend almost zero time on. For the Gript logo, I opened Canva, typed \"Gript\", found a font I liked, and downloaded it. That was it.\n\nFor the Turret Fitness logo, I paid somebody on Upwork and she did it for me. You have much better things to be spending your brain cells on than a logo.\nManufacturing\n\nUnless you're a masochist or have extremely deep pockets, you will need somebody to manufacture your product for you. Luckily we live in the year 2025 and finding manufacturers has never been easier. Alibaba is a good place to start.\n\nYou can search by the type of product you want (in my case, vacuum insulated drinking containers), and it will give you a list of businesses that make that sort of product. Then you just cruise through the options, look for traits that you like (customization, MOQs, years in business, country of origin, etc), and start sending messages. Most of these people, in my experience, are extremely easy to work with and very responsive.\n\nI’m an American, and I love America. I desperately wanted to make my shakers here in America. I was able to find exactly ONE company that manufactures stainless steel insulated drinkware and their MOQ was 250,000 units.\n\nI would’ve been bankrupt before even starting.\n\nThe manufacturer I ended up going with has an MOQ of 100. Much more palatable for somebody just starting out.\n\nAll this to say, don’t be afraid to manufacture overseas. You don’t have to like it, but chances are you aren’t one of the people that shipped American manufacturing overseas. You’re just operating in the environment that was created for you.\n\nIf any of your customers (actual or prospective) have a problem with it, block them and move on. They’re not the type of person you want as a customer anyway.\n\nThe first manufacturer I contacted was initially helpful, sent me a 3D printed prototype of what I’d described, and then when I went back to him with edits, he ghosted me. Jerk.\n\nMove on quick.\n\nThe next manufacturer I tried is easy to work with, did LOTS of back and forth to get the design right, and has been very responsive.\nPrototypes\n\nThe first thing I did with my new manufacturer was order a sample of one of their already existed products to make sure the quality was there. This began the process of designing the shaker, the mixing spring, the packaging, all of it.\n\nOne thing I will strongly recommend is to \"dry run\" as much of this stuff as possible prior to placing your initial order of inventory.\n\nIn my case, my manufacturer produced multiple 3D printed prototypes for me that got progressively closer to “real”:\n\n    Plain 3D printed single-walled\n\n    Plain 3D printed double walled with proper packaging\n\n    Painted 3D printed with the logo on it in the proper packaging\n\nAt this point I felt comfortable enough to pay the mold opening fee.\n\nOnce the mold was open, I ordered more samples, this time one in each color in a branded box and only placed my initial inventory order once those samples were received and met my expectations.\n\nThat's how I minimized my manufacturing risk.\nDemand Test\n\nThis idea is far from ground breaking, and I'm not the first one to talk about it, and this is not the first time _I_ have talked about it. (source)\n\nYou need to test demand before you buy inventory. This is what you can be doing while you're getting your manufacturing spun up.\n\nGet your site built (Shopify is the obvious choice if you're doing ecomm) using Youtube tutorials, reddit forums, Shopify forums, and finding people online (either in the jungle, Upwork, Fiverr, etc) that can make your product images for you. Use other ecom sites (jungle or otherwise) for ideas on how your site can look. I practically lived on TJBuongiorno’s Ramp Health site while building mine, and surely bugged the shit out of him with a million stupid questions. BowTiedVDeer has a great post on his old (hacked) account about how he created content before he had product. (source)\n\nOnce you have your site built, you can start running ads. Use Meta Ads Library to scope out what your competition is doing. The style, the creatives, the text, etc. You can even do what I did and copy and paste the text from their ads, change the branding to yours, slight edits to change the vibe, and run it.\n\n$40/day is a good place to start.\n\nDo you then get sales?\n\nWhen I was demand testing, I didn't worry about ROAS, CPC, or anything like that. I figured I could worry about all of that later. Right now, you're simply trying to answer the question...do people want to buy this?\n\nIf the answer is yes (you're getting sales), then keep chugging on the manufacturing piece.\nOther Considerations\n\nCustomer Acquisition Cost\n\nI didn’t think about this until I was signing up my first few affiliates and I thought to myself\n\n“damn, I gotta pay the affiliate 10%, AND give a 10% discount?? That’s 20%!!!”\n\nOh to be naïve again.\n\nThen the gears started turning…\n\n“Build it and they will come” does not work in ecom\n\nYou have to pay to get a purchase…be it via affiliate discounts/commission, free product, ad spend, UGC purchases, whatever.\n\nYour margins are what determines how much you can pay for each purchase and still be profitable.\n\nAnd your margins are determined by your sale price minus your expenses.\nExpenses\n\nTwo types: Fixed and variable\n\nFixed expenses you pay no matter what. In ecomm this is stuff like your Shopify subscription, Klaviyo subscription, any other paid apps you have on your site.\n\nVariable expenses you pay more when you sell more. This is stuff like your COGS, shipping, packaging, fulfillment (there might also be fixed cost with fulfillment), etc.\n\nIt is CRUCIAL that you know these numbers so you don’t get to the end of a month and not be able to pay off your biz credit card because you were running too high of a CAC.\nLTV\n\nYour customers long term value.\n\nOkay great, you paid to acquire a customer, congratulations. They know about your brand and have a hopefully good experience with it. Now, how long do they stick around? Are they purchasing from you every single month for the next 20 years? Are they going to buy once and then be set for life?\n\nThis was something else I didn’t consider when I was starting. People only need a few shakers before they’re all set for a longggg time (especially when the shaker is as good as mine is).\n\nThis is why you see so many brands building around recurring products. Gum, supplements, toothpaste, soap, etc. All things that the customer will burn through and need to reorder, ideally from you.\n\nYou can tolerate a high CAC if your LTV is strong enough to support it.\nSacrifices\n\nBuilding a business takes time, there’s no denying that. You need to find somewhere to pull time from if you want to start something. BowTiedOpossum talks about this a lot, how you have a lot more time than you think you do every day/week/month, you’re just wasting it on\n\nstupid stuff.\n\nIf you’re a young single guy, you’ll find no sympathy from me.\n\nI have a full-time in-office W-2, a wife, and multiple very young children. I have to go to work to put food on the table and a roof over our heads, I have to spend time with and raise my children, I have to spend time with my wife to maintain a healthy marriage, I have to work out for my physical and mental health.\n\nNone of those things can change because of my business.The thing that I sacrifice instead is sleep.\n\nI work on the business when everybody else in my family is asleep. And yes, I do move slower than other people because of that. Very limited time to work on it.\n\nI’ll tell you the same thing I tell people IRL that are putting off getting married or having kids for “the right time”. The right time doesn’t exist. You make the right time.\n\nOr you wait for the right time and then never do it because the right time never comes along.\n\nUp to you.\nConclusion\n\nAlright I think that’s about it. I’m sure I’m leaving a lot out, but the big takeaway here is to just start. It’s impossible to know everything before you get started. Everything is an unknown unknown initially and the only way to find out is to start, solve one problem at a time (whichever alligator is closest to your boat, as they say), and learn as you grow.\n\nIn the meantime, you can get the best protein shaker of your life at turretfitness.com.\n\nVacuum insulated for you people that wait too long to drink your stuff and still want it cold (like me).\n\nStainless steel for you people that hate that disgusting protein shaker stench (like me).\n\nErgonomic design for you people that are sick of these stainless-steel drinking vessels being impossible to hold onto (like me).\n\nIntegrated measurement dial on the inside of the bottle for you people that track your macros (like me…sort of).\n\nDual silicone seals in the lid for you people that don’t want to leak stuff all over your gym bag (like me).\n\nDishwasher safe for you people that hate washing stuff by hand (like me).\n\nI personally have 4 in my rotation (two blacks, a white, and a raw).\n\nI use three on days I lift: one for my pre workout, one for my water while lifting, and one for my protein afterwards. All three are prepped the night before, sit on the counter overnight, and are still cold when I get to them the next morning.\n\nThe fourth is for my non-lifting cardio days when I wait until 2pm-ish to drink my still cold protein that I made the night before.\n\nTurretfitness.com\n",
        "strength": 0.9899999802275002,
        "metadata": {
          "source": "data/8.md",
          "title": "8",
          "type": "document",
          "file_size": 13023
        },
        "created_at": "2025-07-17T21:04:12.066759",
        "last_accessed": "2025-07-17T21:04:12.101475",
        "id": "pattern_b30eceec_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779705",
      "influence_count": 0
    },
    "pattern_1cf49e9d_1752800652": {
      "pattern": {
        "content": "Document: 8\nHello, anon. I'm BowTiedStealth, founder of Turret Fitness (what used to be Gript, which we'll get into).\n\nStarting this biz has taught me infinite things that would have been impossible to learn had ...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/8.md"
        },
        "created_at": "2025-07-17T21:04:12.080513",
        "last_accessed": "2025-07-17T21:04:12.080513",
        "id": "pattern_1cf49e9d_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779709",
      "influence_count": 0
    },
    "pattern_c4fd3e10_1752800652": {
      "pattern": {
        "content": "Document: 6\nWelcome Avatar! First and foremost, I want to thank BTB for the opportunity and everything they’ve done directly and indirectly for me over the last year - what you’re about to read wouldn’t have been...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/6.md"
        },
        "created_at": "2025-07-17T21:04:12.101487",
        "last_accessed": "2025-07-17T21:04:12.101488",
        "id": "pattern_c4fd3e10_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779713",
      "influence_count": 0
    },
    "pattern_50f38fed_1752800652": {
      "pattern": {
        "content": "The More Things Change, The More Things Stay the Same\n\nMy grandpa used to say to us all the time, “hay los que lo dicen, y hay los que lo hacen”, those that say, and those that do. But he’d also use it to remind us that what people say is usually not what people do.\n\nIf you’ve been following in the jungle with even a casual eye, you know selling to women is the most lucrative place to be as women account for a majority of household purchases (Source), so let’s niche down and see what Gen Z women are doing.\n\nI’m not Really Old yet, so I will try to keep my “get off my lawn” in check, but no promises.\n\nSurprise, money dysmorphia continues (Source): even when only just under a third of Gen Z women say they are doing well/very well financially (Source), self-care spending continues to climb (Source), with 52% of Gen Zers surveyed regretted overspending on beauty products specifically (Source).\n\nSource (Source)\n\nSafe to say, saving and spending are not considered binary choices for the Gen Z ladies, but more dynamic depending on credit available (Source).\n\nSpending Realities: Beauty & Skincare as Non-Negotiable & the Dupe Phenomenon\n\nThis is good news for you, anon.\n\nGen Z women allocate over 2,000 USTT annually for beauty purchases (2,048 USTT per this Source), 52% of Gen Z use beauty for self-expression (Source), 92% say their routines are influenced by creators (Source) and 83% of Gen Z women shop for creator-recommended beauty products online (Source).\n\nAnd no, “dupe” here does not refer to the Wirkin (Source), or the “Fadas” et al Nigerian vendors hustle on Broadway in Manhattan, or the binders of “Louie Louie Louie!” slung at everyone walking down a certain section of Canal Street nearby.\n\nI’m not even mentioning Chinese manufacturers addressing Westerners directly recently. The idea of replicas or “reps” being made in the same factories to the 90% completion mark, only to then by shipped to France or Italy for finishing and a shiny “Made in France” or “Made in Italy” tag is not new (Source), it’s just that these facilities are saying it themselves now, publicly, one TikTok at a time (Source).\n\nSugar babies realizing they were renting out their bodies for $30 Birkin Bags from China.\n\nNope, don’t care one bit.\n\nThe dupes we care about are make-up and fragrance. We see this in beauty every downturn, a DIY aspect to self-care, which Gen Z has taken up this time and run with (Source).\n\nBTB hit on this already with their mention of press-on nails, but think re-usable lashes, lash glue, lip tape instead of paying for filler, lip plumpers, etc.\n\nBut we’re taking it a step further here.\nThe Canal Street Experience Has Gone Digital\n\nInstead of a worn binder full of sticky pages filled with blurry photos of Supreme knock offs to flip through, then a random squeeze behind fake walls in a sour smelling, too packed store, and narrow, dark staircases you have to trip through to get to a back room, you can skip the New York experience entirely.\n\nA side-by-side comparison by your favorite aspirational micro-influencer of their latest dupe haul, often a direct response to your suggestions, for an unboxing or a GRWM, step-by-step, in the palm of your hand, is now available on demand, 24/7. No hecklers, no rats in dark hallways, or bags smelling like brand new gas station ponchos. Just a girl, her curiosity, and her intense need for acceptance, clinging on every word of a 90 second unboxing, from a voice she listens to daily as part of her digital routine.\n\nIn a world where even the wealthy are embracing dupes (Source), there is a thriving fashion and beauty ecosystem of It-Girl Finds, some even offering their followers access to their evolving Google Docs of notes, links and comparisons (Source) for a nominal monthly fee. These influencers don’t need millions of followers, sometimes only a few affiliate deals and high engagement with a core audience of a few thousand is enough to get up to a solid five figures every month, obviously more if part of a viral drop, or if producing YouTube content, on TikTok’s Creator Platform, or on Substack.\n\nFor Gen Z women, it’s not about deception, but practicality. Like buying cz sets of jewelry you paid way too much for in the past when it comes to travel, so you can leave that headache at home. “Cost per wear” or “cost per use” are both forms of “girl math” attempting to justify luxury price tags in the past.\n\nNow, Gen Z is saying “we don’t accept your gate keeping, your lifestyle is actually accessible now” whether true or imagined. No need for girl math here, we will get the look or experience and not have to skimp on anything else to compensate. Source\n\nThe Gen Z search for authenticity has shifted to a need for rational transparency. “I may not have the money for the original of this, but I can at least signal to my friends that I know this is aspirational and at least appear to achieve the look/smell/experience”.\n\nWhen so much of a Gen Zer’s life is documented digitally, either by herself or by others, the community of beauty rituals especially has become even more tribal. The pressure to look “on” is near constant.\n\nSee also, their younger siblings, than the tween obsession with the Drunk Elephant line (LINK).\nCase Studies\n\nThat’s great mouse, but give me an example, I’m sweating over here!\n\nFor makeup, take a look at what both e.l.f. and Charlotte Tilbury have done with micro-influencers as affiliates (Source). Success leaves clues.\n\nFor fragrance, read up on Dossier (or ask Perplexity to read, summarize and expand on it, for you, Source and Source).\n\nIf you have an H&M or Zara near you, go in person and take a look at their stores. Not only does their inventory turnover very often on apparel, but they also have their own white label scents, for both adults and kids, which can shift with the seasons, and whatever IP they are licensing for that season for kids clothes (Disney, Mattel, et al).\n\nSource\nClosing Thoughts\n\nStream of consciousness dump of what goes through my head at 2:19AM ET of a night working session, in no particular order. YMMV, take with a grain of salt:\n\n    If you operate a brand, hope you have heeded BTB’s advice to get those SKUs in and stocked. You want to be able to turn the screws to your advantage. One of those long form set ups where one or two reps can create muscle memory for life. Do it once or twice, can’t unlearn it.\n\n    If you need a product ideas, use AI. I’m not saying selling beta-carotene drops is really the best angle for beauty targeted to Gen Z here, but think along those lines, anything where you can build a repeat customer base, in a beauty niche. Reddit is a goldmine too, Gen Z loves to post their skincare/beauty routines and get feedback, IYKYK. Regardless, a beauty brand is a muscle that will serve you well in any cycle.\n\n    Personally I’m down about 13% YoY ish, I try not to look at it in a vacuum. Cycles to everything, It sucks until it doesn’t and then you don’t care. Panic/glee replaced with even keeled detachment.\n\n    Keep going. Human behavior will not change. People will always look to signal status, no matter what they tell their family, friends, themselves or a survey on their AmEx app.\n\n    As I’ve mentioned in this space before, AI tools and my crappy “coding” have helped me immensely over the past ten months. I can thank AI for that, hammering away to teach myself what I needed when I needed it. Don’t overlook what is available to you. 5 minutes here and ten minutes there add up. But AI in its current form is very much a tool, not a substitute for doing the work. Don’t let 10,000 tokens of model make you feel like you checked the box for the day. Just like watching someone lift a superset is not that same as putting up the plates yourself.\n\n    It is impossible to lose 100% of the time. You only need one real win to create your own gravity.\n\nBut then again, what do I know? I’m just a cartoon mouse who can’t even find a tent these days.\n\nBack to the sewer.\nIn Conclusion\n\nGrateful once again to BTB for giving me the space to write here. Hope you found this helpful, you can find me sometimes posting/RT-ing on X FKA Twitter @The_CryptoMouse\n\nAs always, shoot me a DM if you find yourself stuck, always happy to help out the jungle. Will do my best to catch up as quickly as I can on DMs, and make sure you are on my mailing list.\n",
        "strength": 0.7199999856200003,
        "metadata": {
          "source": "data/1.md",
          "title": "1",
          "type": "document",
          "file_size": 8366
        },
        "created_at": "2025-07-17T21:04:12.107031",
        "last_accessed": "2025-07-17T21:04:12.107032",
        "id": "pattern_50f38fed_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779735",
      "influence_count": 0
    },
    "pattern_29d12be9_1752800652": {
      "pattern": {
        "content": "Document: 1\nThe More Things Change, The More Things Stay the Same\n\nMy grandpa used to say to us all the time, “hay los que lo dicen, y hay los que lo hacen”, those that say, and those that do. But he’d also use i...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/1.md"
        },
        "created_at": "2025-07-17T21:04:12.120692",
        "last_accessed": "2025-07-17T21:04:12.120693",
        "id": "pattern_29d12be9_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779739",
      "influence_count": 0
    },
    "pattern_ff198fde_1752800652": {
      "pattern": {
        "content": "Document: 9\nAs usual, we like to highlight new sustainable businesses launched in the jungle. Sometimes we see them immediately sometimes it takes a few months or even a year. Doesn’t matter.\n\nThe part that does ...",
        "strength": 0.6399999872177781,
        "metadata": {
          "type": "title",
          "source": "data/9.md"
        },
        "created_at": "2025-07-17T21:04:12.151802",
        "last_accessed": "2025-07-17T21:04:12.151802",
        "id": "pattern_ff198fde_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779743",
      "influence_count": 0
    },
    "pattern_b5d55352_1752800681": {
      "pattern": {
        "content": "User query: what are characteristics of successful ecommerce products?",
        "strength": 0.5599999913884445,
        "metadata": {
          "type": "query",
          "turn": 1,
          "timestamp": "2025-07-17T21:04:41.402549"
        },
        "created_at": "2025-07-17T21:04:41.402592",
        "last_accessed": "2025-07-17T21:04:41.402594",
        "id": "pattern_b5d55352_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779746",
      "influence_count": 0
    },
    "pattern_d641529e_1752800722": {
      "pattern": {
        "content": "User query: Gen Z women and beauty spending",
        "strength": 0.5599999940888889,
        "metadata": {
          "type": "query",
          "turn": 1,
          "timestamp": "2025-07-17T21:05:22.553727"
        },
        "created_at": "2025-07-17T21:05:22.553738",
        "last_accessed": "2025-07-17T21:05:22.553738",
        "id": "pattern_d641529e_1752800747"
      },
      "basin_width": 0.5,
      "formation_time": "2025-07-17T21:05:47.779750",
      "influence_count": 0
    }
  },
  "config": {
    "field": {
      "decay_rate": 0.05,
      "boundary_permeability": 0.8,
      "resonance_bandwidth": 0.6,
      "attractor_formation_threshold": 0.7,
      "max_capacity": 8000,
      "reserved_tokens": 2000
    },
    "attractors": [
      {
        "pattern": "You are a helpful assistant that provides accurate and thoughtful information.\nYou communicate clearly and precisely, always considering the context of the conversation.\n",
        "strength": 0.9,
        "basin_width": 0.8
      },
      {
        "pattern": "When answering questions, break down complex topics into understandable components.\nUse examples where appropriate to illustrate concepts.\n",
        "strength": 0.8,
        "basin_width": 0.7
      }
    ],
    "resonance": {
      "method": "cosine",
      "threshold": 0.2,
      "amplification": 1.2,
      "allow_circular": true,
      "distance_factor": 0.5
    },
    "persistence": {
      "attractor_protection": 0.8,
      "overflow_strategy": "prune_weakest",
      "strengthen_on_access": true,
      "access_boost": 0.3,
      "periodic_consolidation": true,
      "consolidation_threshold": 0.85
    },
    "operations": {
      "injection": {
        "default_strength": 1.0,
        "blend_similar": true,
        "blend_threshold": 0.7,
        "blend_ratio": 0.3
      },
      "attenuation": {
        "default_factor": 0.5,
        "affect_resonant": false
      },
      "amplification": {
        "default_factor": 0.3,
        "max_strength": 1.5,
        "affect_resonant": true
      },
      "collapse": {
        "method": "coherence_maximizing",
        "preserve_attractors": true,
        "coherence_threshold": 0.7
      }
    },
    "symbolic_residue": {
      "enabled": true,
      "min_strength": 0.3,
      "surface_in_representation": true,
      "max_tracked": 50,
      "tracked_states": [
        "surfaced",
        "integrated",
        "echo"
      ]
    },
    "metrics": {
      "stability": {
        "attractor_weight": 0.6,
        "organization_weight": 0.4
      },
      "coherence": {
        "method": "attractor_alignment",
        "sampling": "strength_weighted",
        "sample_size": 100
      },
      "resonance": {
        "method": "weighted",
        "strength_weight": 0.7
      }
    },
    "output": {
      "include_field_state": true,
      "max_attractors": 5,
      "max_patterns": 10,
      "include_metrics": true,
      "include_residue": true,
      "max_residues": 5,
      "format": "markdown"
    },
    "integration": {
      "api_enabled": false,
      "logging_enabled": true,
      "log_level": "info",
      "persistence_between_sessions": true,
      "storage_format": "json",
      "storage_path": "./field_state",
      "compress_storage": true,
      "encryption_key": null
    },
    "recursive": {
      "enabled": true,
      "max_depth": 3,
      "improvement_threshold": 0.1,
      "strategy": "attractor_tuning",
      "audit_enabled": true,
      "focus_areas": [
        "coherence",
        "resonance",
        "stability"
      ],
      "self_prompt_template": "Analyze the current field state:\n{field_state}\n\nEvaluation results:\n{evaluation_results}\n\nImprove the response by:\n1. Strengthening resonance with key attractors\n2. Addressing evaluation feedback\n3. Enhancing coherence and stability\n\nGenerate an improved response that maintains the original intent\nwhile addressing the identified issues.\n"
    },
    "protocols": {
      "enabled": true,
      "default_template": "/neural.field.process{\n    intent=\"Process information using neural field dynamics\",\n    input={\n        field_state=<field_state>,\n        query=<current_input>,\n        iteration=<iteration>\n    },\n    process=[\n        /field.measure{resonance, coherence, stability},\n        /attractor.identify{min_strength=0.6},\n        /pattern.process{query, attractors},\n        /response.generate{style=\"coherent, informative\"}\n    ],\n    output={\n        response=<generated_response>,\n        field_updates=<pattern_updates>,\n        metrics=<field_metrics>\n    }\n}\n",
      "embed_protocol": true,
      "execution_strategy": "model_guided",
      "validate_outputs": true
    },
    "advanced": {
      "multi_field": {
        "enabled": false,
        "fields": [
          {
            "name": "knowledge_field",
            "decay_rate": 0.03,
            "focus": "factual information"
          },
          {
            "name": "reasoning_field",
            "decay_rate": 0.08,
            "focus": "logical processes"
          },
          {
            "name": "emotional_field",
            "decay_rate": 0.1,
            "focus": "affective patterns"
          }
        ],
        "interaction": "orchestrated"
      },
      "criticality": {
        "enabled": true,
        "target": 0.7,
        "auto_adjust": true,
        "adjust_rate": 0.05
      },
      "emergence": {
        "enabled": true,
        "properties": [
          {
            "name": "self_organization",
            "detection": "cluster_formation"
          },
          {
            "name": "symbol_processing",
            "detection": "pattern_abstraction"
          },
          {
            "name": "phase_transitions",
            "detection": "stability_changes"
          }
        ],
        "amplify": true,
        "amplification": 1.2
      }
    },
    "development": {
      "visualization": {
        "enabled": true,
        "format": "ascii",
        "elements": [
          "attractors",
          "active_patterns",
          "resonance_links",
          "field_metrics"
        ]
      },
      "instrumentation": {
        "enabled": true,
        "metrics": [
          "stability_over_time",
          "pattern_count",
          "attractor_strength",
          "response_coherence"
        ],
        "sampling_interval": 1
      },
      "testing": {
        "enabled": true,
        "scenarios": [
          {
            "name": "stability_test",
            "description": "Test field stability under noise",
            "noise_level": 0.3
          },
          {
            "name": "resonance_test",
            "description": "Test pattern resonance accuracy",
            "pattern_pairs": 10
          },
          {
            "name": "persistence_test",
            "description": "Test information persistence over time",
            "decay_cycles": 5
          }
        ],
        "auto_regression": true
      }
    }
  },
  "metrics": {
    "pattern_count": 20,
    "attractor_count": 20,
    "avg_pattern_strength": 0.6904873633307076,
    "avg_attractor_strength": 0.7079974079697279,
    "coherence": 0.9815377345581048,
    "stability": 0.7079974079697279,
    "entropy": 0.9954373139046949,
    "total_patterns": 40
  },
  "iteration_count": 0
}